[
  "I broke up with someone because they didn't like my favorite movie.",
  "I pretended to be interested in a hobby just to impress a date.",
  "I tried to control my partner by demanding constant check ins and location updates.",
  "I belittled my date's profession to boost my own ego and feel superior.",
  "I pretended not to recognize my date when they approached me, just to see how they would react.",
  "I avoided spending time with my partner's family and friends to assert dominance in the relationship.",
  "I intentionally flirted with someone's partner just to see if I could steal them away.",
  "I refused to apologize or admit my mistakes, always putting the blame on my partner.",
  "I used my partner's insecurities against them during arguments.",
  "I played mind games, testing my partner's loyalty and commitment.",
  "I asked my date to meet me at a park out of town and then showed up wearing a disguise.",
  "I intentionally made my partner jealous by flirting with others, then denied it.",
  "I withheld affection or gave the silent treatment to manipulate my partner's behavior.",
  "I frequently interrupted my date to take selfies and update my social media status.",
  "I intentionally picked a fight with my partner just to see if they would fight back.",
  "I gave someone an ultimatum to choose between me and their friends.",
  "I struggled with allowing my partner to have personal space and independence.",
  "I faked a surprise birthday party for myself to see if my partner remembered my birthday.",
  "I opted for a fancy dinner date just so I could post a photo on social media.",
  "I flirted with someone just to boost my own ego, with no intention of taking it further.",
  "I flirted with other people in front of my date just to see their reaction.",
  "I got jealous and angry when my date spoke to someone of the opposite sex.",
  "I belittled and mocked my partner's achievements to inflate my own self worth.",
  "I interrupted my date every time they spoke about their achievements, wanting to one up them.",
  "I ignored all of my partner's messages for several days solely to make them feel desperate for my attention.",
  "I openly flirted with others in front of my partner to make them jealous.",
  "I manipulated someone's emotions to maintain control in a relationship.",
  "I purchased extravagant gifts for a date so they would be indebted to me emotionally.",
  "I refused to eat at a certain restaurant because their food wasn't \"Instagrammable\" enough.",
  "I used a pickup line that backfired and made the other person laugh in my face.",
  "I made my date watch a movie I love even though I knew they despised it.",
  "I couldn't handle any form of criticism and emotionally shut down during conflicts.",
  "I canceled a date at the last minute, claiming to be too busy, when in reality, I just didn't feel like going.",
  "I threw a tantrum when my date ordered a dish that I didn't like.",
  "I played the victim card in every disagreement, making my date feel guilty for expressing their emotions.",
  "I flirted with the bartender while on a date.",
  "I ended a relationship abruptly because they voted for a different political party.",
  "I pretended to have a traumatic life event as a means of getting sympathy from potential partners.",
  "I compared my date to my exes constantly, pointing out their flaws and shortcomings.",
  "I incessantly talked about myself without once asking my date a single question about themselves.",
  "I intentionally flirted with other people when my partner had just expressed their insecurity.",
  "I used my date as an ego boost, bragging about them to others to enhance my social status.",
  "I critiqued my date's fashion choices throughout the entire evening.",
  "I pouted and threw a tantrum when my partner didn't buy me an expensive gift on our anniversary.",
  "I made my date feel guilty for having a good time without me when we weren't together.",
  "I brought up controversial topics during a date on purpose to cause disagreement.",
  "I intentionally left my phone unlocked knowing that my partner would snoop through it.",
  "I badmouthed my ex to my current partner, painting myself as the victim.",
  "I purposely chose expensive restaurants for dates just to make myself seem more high status.",
  "I used manipulative tactics to make my partner doubt themselves and their own worth.",
  "I brought my pet on a date and paid more attention to it than to my date.",
  "I intentionally flirted with someone else in front of my partner to provoke jealousy.",
  "I purposely flirted with someone else to make my date jealous.",
  "I openly flirted with strangers while on a date, as though my date wasn't even there.",
  "I revealed personal and extremely intimate details about my past within the first five minutes of meeting my date.",
  "I constantly checked my ex's social media profiles while out on a date.",
  "I constantly sought validation and reassurance from others, even while being in a relationship.",
  "I made my partner choose between going to their friend's wedding or my high school reunion.",
  "I interrupted my date multiple times to speak about my own interests.",
  "I gave my partner the silent treatment for days as punishment for a minor disagreement.",
  "I expected my date to constantly validate my ego.",
  "I asked intrusive and personal questions right off the bat to unsettle my date.",
  "I hijacked conversations to talk excessively about myself and dismissed my date's thoughts.",
  "I went on a blind date just to have a free dinner without genuine interest in the person.",
  "I intentionally spoke at a volume just enough to make the other person lean in closer and give me more attention.",
  "I intentionally played hard to get to keep my date interested.",
  "I resorted to giving silent treatments during disagreements instead of discussing issues.",
  "I snooped through my partner's phone and personal belongings to validate my own insecurities.",
  "I ended a relationship because my partner didn't meet my unrealistic physical standards.",
  "I used dating apps solely for validation and never had any intention of meeting up with anyone.",
  "I bragged about my social media followers to impress a date.",
  "I ghosted someone I had been dating for months without any explanation.",
  "I faked being busy with work to avoid going on a second date.",
  "I refused to eat at a restaurant because they didn't have my favorite brand of bottled water.",
  "I vanished on a date without explanation because I spotted someone more attractive across the room.",
  "I bought a fake designer handbag to impress my date.",
  "I hooked up with someone else the same night after a successful date, just to boost my ego.",
  "I sabotaged a potential partnership because the person had more followers on social media.",
  "I walked out of a movie theater mid date because the movie wasn't to my liking.",
  "I forgot someone's birthday even though we had been dating for months.",
  "I played mind games by intentionally being vague and mysterious on a date.",
  "I cancelled a date to go to the spa.",
  "I stalked my ex on social media during a date and couldn't resist commenting on their photos.",
  "I unfollowed and blocked my partner's exes on social media to erase any \"competition.\"",
  "I spent the entire date talking about my previous failed relationships and the deficiencies of my ex partners.",
  "I made remarks that suggested I was \"out of the other person's league,\" aiming to boost my own self esteem.",
  "I flirted with someone in front of my date to see if they would confront me about it.",
  "I made snide comments about my date's appearance, trying to boost my own self esteem.",
  "I constantly checked my phone and replied to messages while on a date.",
  "I talked in a condescending tone and demeaned the other person's knowledge in various subjects.",
  "I purposely showed up late to a date as a power play and to establish dominance.",
  "I emotionally manipulated my date into distancing themselves from friends and family, prioritizing me.",
  "I took offense when my date didn't like every photo of me on social media.",
  "I consistently lied about my whereabouts and what I was doing just to keep my date guessing.",
  "I checked my phone every few minutes, blatantly ignoring my date's presence.",
  "I mocked my date's style choices and made snarky comments about their outfit throughout the evening.",
  "I ended a relationship because my partner gained weight and was no longer as physically attractive to me.",
  "I canceled a date because I was having a bad hair day.",
  "I became hostile and aggressive whenever someone didn't prioritizeme over their own needs.",
  "I made snide remarks about my partner's physical appearance, causing them to feel insecure.",
  "I made excessive use of emojis and abbreviation in text messages, pretending it was hip and trendy.",
  "I flirted with the waitstaff in front of my date, trying to make them feel inadequate.",
  "I went on multiple dates in one day, trying to see if I could orchestrate a love triangle situation.",
  "I dramatically ended a relationship via text message.",
  "I ghosted someone because they disagreed with one of my opinions.",
  "I cancelled plans last minute because I found a more exciting option.",
  "I belittled my partner's accomplishments to make myself feel superior.",
  "I insisted on always splitting the bill on dates, even when the other person offered to pay.",
  "I made sarcastic and condescending remarks throughout the entire date, trying to seem intellectually superior.",
  "I made derogatory comments about my partner's appearance to try and gain control in the relationship.",
  "I pretended to be interested in a hobby just because my date was passionate about it.",
  "I ghosted multiple people without any explanation or closure.",
  "I sabotaged my friend's potential love interest because I wanted all the attention for myself.",
  "I refused to acknowledge someone's feelings or emotions, only focusing on my own needs in the relationship.",
  "I constantly sought validation from my partner and needed them to constantly convince me of their love.",
  "I intentionally posted old photos on social media to not reveal my true appearance.",
  "I canceled a planned date last minute because I found out my ex was in town.",
  "I sabotaged my friend's date by praising myself incessantly to steal the spotlight.",
  "I expected constant validation and praise from my partner, becoming resentful when I didn't receive it.",
  "I purposely picked a restaurant my date was allergic to, just to see their reaction.",
  "I gaslighted my partner, making them doubt their own memory and perception of events.",
  "I casually mentioned how many people were interested in me to boost my ego.",
  "I interrupted my date multiple times to share irrelevant and trivial stories.",
  "I constantly needed validation and compliments from my partner.",
  "I consistently interrupted my date's stories to talk about myself and my achievements.",
  "I intentionally made my date jealous by flirting with other people.",
  "I became jealous of a partner's pet and demanded they get rid of it.",
  "I resorted to emotional blackmail to get my partner's attention and affection.",
  "I sent hundreds of texts to someone I just met, overwhelming them with my neediness.",
  "I made an excessive number of voice notes during the first few dates to make myself seem more interesting.",
  "I gave false compliments to manipulate someone into liking me.",
  "I made rude remarks about my date's appearance throughout the entire evening.",
  "I snooped through my partner's personal belongings and messages without their knowledge.",
  "I critiqued my date's physique and gave unsolicited advice on how they could improve their appearance.",
  "I complained about my past relationships during the entire duration of a date.",
  "I flirted with the bartender to get free drinks while on a date.",
  "I proposed on a first date as a desperate attempt to hold onto my date before they lose interest.",
  "I made an embarrassing scene by demanding special treatment from a restaurant manager because I thought it would impress my date.",
  "I flirted with someone's friend right in front of them to make them jealous.",
  "I flirted with someone's friend to make them jealous.",
  "I intentionally wore a revealing outfit on a first date to get attention.",
  "I withheld affection from my partner to have control over their emotions.",
  "I demanded that my date pay for the meal, even though I invited them out.",
  "I consistently broke promises and committed to things I had no intention of following through with.",
  "I demanded constant reassurances from my partner about our relationship.",
  "I consistently canceled plans last minute to keep my partner always on edge and anxious about my commitment.",
  "I pressured someone into moving faster in a relationship, disregarding their feelings and boundaries.",
  "I gave my date a detailed critique on their figure and recommended areas they should improve.",
  "I brushed off sincere compliments from my date, fishing for more extravagant praise.",
  "I talked non stop about my accomplishments the entire time, ignoring my date's interests.",
  "I compared all my dates to my fantasy \"perfect partner,\" and ended things for not measuring up.",
  "I intentionally disregarded my partner's boundaries for my own satisfaction.",
  "I constantly talked about myself and didn't show any interest in my date's life.",
  "I kept bringing up topics that I knew would make the other person uncomfortable or upset.",
  "I had unrealistic expectations about what a perfect partner should be like.",
  "I lied about my sexual history to make myself seem more experienced.",
  "I intentionally made my partner jealous to test their loyalty.",
  "I exclusively dated people for their looks or status, not caring about their personality or compatibility.",
  "I broke up with someone in a text message to avoid confrontations.",
  "I faked a family emergency to end a date early when I found someone more attractive nearby.",
  "I logged into my partner's social media accounts without their knowledge or consent.",
  "I took every opportunity to boast about my body, fitness regime, and dieting.",
  "I intentionally kept my partner insecure and unsure about the relationship to maintain control.",
  "I constantly made passive aggressive comments throughout the date to manipulate my date's reaction.",
  "I brought up personal and sensitive topics in order to make my date feel uncomfortable and vulnerable.",
  "I manipulated conversations to steer towards my own achievements and success.",
  "I argued incessantly with partners just to prove I was always right.",
  "I pretended to be interested in my date's hobbies and passions just to impress them.",
  "I ignored my date's messages for hours just to keep them anxious and unsure of our standing.",
  "I kept bringing up my past relationships while on a first date.",
  "I sabotaged my partner's job interview to prevent them from moving across the country.",
  "I staged a fake emergency to see if my date would put me first.",
  "I made my date feel guilty for not spending enough time with me, even though they had other commitments.",
  "I lectured my date about proper grammar and corrected every sentence they said.",
  "I laughed loudly and significantly at my own jokes, but barely acknowledged the other person's humor.",
  "I broke up with someone because they disagreed with my favorite author's views.",
  "I used a dating app just to boost my ego and collect compliments.",
  "I exaggerated my job title to make myself appear more successful.",
  "I intentionally manipulated someone's feelings to make myself feel more desirable.",
  "I challenged potential partners to contests or competitions to prove my superiority.",
  "I manipulated someone's emotions to keep them interested in me.",
  "I flirted with someone solely to prove I could attract them, without any real interest.",
  "I exaggerated my career success to impress my date.",
  "I frequently compared my partner to the \"perfect\" ex, making them feel inferior.",
  "I exhibited jealous and possessive behavior, trying to control my partner's every move.",
  "I pouted and sulked during a date, seeking constant validation and attention.",
  "I broke up with someone because they wore the same outfit as me on a date.",
  "I spent the entire date talking about myself, never asking my date any questions.",
  "I created elaborate stories about my achievements to impress my date, even though they were fabrications.",
  "I boasted extensively about my wealth and material possessions during a date.",
  "I spent the entire evening talking only about myself.",
  "I pretended to be interested in someone's hobbies just to impress them.",
  "I emotionally manipulated people and guilt tripped them into doing things they didn't want to.",
  "I bragged excessively about my accomplishments and material possessions.",
  "I emotionally manipulated someone by playing the victim and guilt tripping them.",
  "I purposely ordered the most expensive items on the menu, expecting the other person to pay without asking.",
  "I became extremely clingy and possessive in a relationship to feel more secure.",
  "I refused to compromise in any way, always expecting my partner to cater to my needs.",
  "I made demeaning comments about my date's hobbies and interests, making them second guess themselves.",
  "I pouted and gave the silent treatment for hours because my date disagreed with my opinion.",
  "I handed my date a pre written time schedule for the date, not allowing any spontaneity.",
  "I ghosted someone I was dating without any explanation.",
  "I enjoyed making my date feel jealous and insecure by flirting with others in their presence.",
  "I monopolized the conversation and made sure my date couldn't get a word in edgewise.",
  "I made my partner feel guilty for pursuing their own goals and dreams.",
  "I lied about my relationship status to make someone more interested in me.",
  "I insisted on having the restaurant change their seating arrangements because I wanted to be seen by everyone in the room.",
  "I constantly checked myself out in reflective surfaces during a date, completely ignoring my date's presence.",
  "I insisted on arguing in public, embarrassing my partner simply to prove a point.",
  "I pretended to be a food connoisseur on a date and didn't actually like the food.",
  "I intentionally ordered the most expensive items on the menu and expected my date to pay.",
  "I fabricated an exclusive invitation to a fancy event to impress a potential partner.",
  "I spent most of the date taking pictures of myself, disregarding any conversation with my date.",
  "I dated multiple people at the same time without being honest about it.",
  "I demanded my partner to quit their favorite hobby because I felt jealous of the attention it received.",
  "I purposely flirted with random strangers to make my date feel jealous.",
  "I constantly played mind games with my date, intentionally stringing them along.",
  "I made a snobby comment about my date's choice of clothing, belittling their fashion sense.",
  "I refused to go to a movie theater because they didn't have premium seats.",
  "I spread rumors about my ex out of spite after a messy breakup.",
  "I flirted heavily with the waiter or waitress, completely disregarding my date's feelings or presence.",
  "I frequently commented on my partner's weight and appearance, causing them body image issues.",
  "I made passive aggressive comments disguised as jokes to hurt my partner's feelings.",
  "I sabotaged my ex's dating profile by leaving fake negative reviews.",
  "I kept an ex as a backup option, even though I was in a new relationship.",
  "I blackmailed an ex partner with embarrassing information to retain control over them.",
  "I refused to accept responsibility for my actions and always played the blame game.",
  "I pretended to be into the same hobbies as my date just to impress them.",
  "I constantly interrupted my date to tell unrelated stories about myself.",
  "I purposefully arrived late to a date to assert dominance and show I'm in control.",
  "I used dating apps solely to boost my ego and receive validation.",
  "I snooped in my date's belongings to gather information about their past relationships.",
  "I insisted on showcasing my luxury belongings and bragged about them on every date.",
  "I created drama and exaggerated small issues to keep my partner on edge.",
  "I sabotaged potential romantic relationships for my own entertainment, just to boost my ego and feel powerful.",
  "I avoided taking responsibility for my actions, always deflecting blame.",
  "I gaslighted my date whenever they expressed discomfort or unhappiness in our relationship.",
  "I flirted shamelessly with the waiter in front of my date to make them jealous.",
  "I confessed my undying love on a first date, scaring the other person off.",
  "I flirted with my server during a dinner date to make my date jealous.",
  "I bragged about my extravagant lifestyle, even though I accumulated most of my possessions through debt.",
  "I purposely provoked arguments just so that my partner would apologize and try to make amends.",
  "I used my phone throughout a romantic dinner, checking notifications and barely listening to my date.",
  "I made my date feel incompetent by boasting about my intelligence and knowledge.",
  "I left in the middle of a romantic dinner to take excessive selfies in the bathroom.",
  "I invited my date to a fancy event, only to spend the entire time networking and leaving them by themselves.",
  "I openly flirted with other people in front of my date to make them jealous.",
  "I made passive aggressive remarks about my date's physical appearance throughout the evening.",
  "I chose to date someone solely based on their appearance rather than their personality.",
  "I brought up my ex partner multiple times during our date, \"accidentally\".",
  "I deliberately provoked jealousy in my partner to make them feel insecure.",
  "I talked harshly or belittlingly about my exes to make myself seem better in comparison.",
  "I intentionally ordered the most expensive items on the menu and expected my date to foot the bill.",
  "I ignored my date the entire evening because they did not like my Instagram post.",
  "I bragged about my luxurious lifestyle, conveniently omitting the fact that it was just a facade.",
  "I manipulated my partner into thinking they were always wrong in arguments.",
  "I spent our entire date talking about how glamorous and fabulous my life is.",
  "I created fake profiles on dating apps to spy on my partner and test their loyalty.",
  "I accused my date of flirting with the waiter just to stir up drama.",
  "I refused to share the armrest at the movies on a date.",
  "I withheld important information about myself to seem edgier and more mysterious.",
  "I humiliated my partner by airing our relationship issues on social media for everyone to see.",
  "I used materialistic gestures as a substitute for genuine emotional connection.",
  "I refused to share anything personal about myself and always redirected the conversation to my date's life.",
  "I intentionally ignored my date's texts just to make them more interested in me.",
  "I faked a phone call during a date to make it seem like I had an emergency and needed to leave.",
  "I pretended to be busy with non existent plans to see if my date would beg me to prioritize them.",
  "I went on multiple dates simultaneously, making each person believe they were the only one.",
  "I sabotaged my own relationships by deliberately picking fights over trivial matters.",
  "I spent the entire date talking only about myself.",
  "I played mind games with someone I was dating to keep them interested.",
  "I ended a relationship via text message without any explanation.",
  "I insisted on paying for everything and made it clear that I expected gratitude.",
  "I ghosted someone after they told me they didn't follow me on social media.",
  "I constantly compared my date to celebrities, emphasizing their flaws.",
  "I constantly talked about myself and showed no interest in my date's life.",
  "I prioritize my own needs and desires over anyone else's in a relationship.",
  "I blamed my partner for all of our relationship problems instead of taking personal responsibility.",
  "I purposely made my ex jealous by posting pictures with a new love interest on social media.",
  "I constantly posted flattering photos of myself on social media to make my partner jealous.",
  "I shared intimate secrets of my partner behind their back just to gain sympathy and attention.",
  "I forgot the other person's name on our second date and pretended I never knew it.",
  "I sent unsolicited shirtless pictures to all my matches on a dating app.",
  "I dressed overly provocatively for a casual coffee date, drawing unwanted attention.",
  "I ignored my date's feelings and only focused on my own needs and desires.",
  "I pretended to have the same interests as my date, even though I had no real knowledge or passion for them.",
  "I tried to make the other person jealous by constantly mentioning all the people interested in me.",
  "I created a fake online persona to see if someone would fall in love with me.",
  "I frequently cried during arguments as a manipulative tactic.",
  "I bailed on a date halfway through because I saw my ex at the same venue.",
  "I constantly competed with my partner in terms of achievements to validate my own self worth.",
  "I deliberately flirted with someone else in front of my date to make them jealous.",
  "I would frequently flirt with other people while on a date to boost my own self esteem.",
  "I googled my date before meeting them to dig up dirt on their past relationships.",
  "I pretended to be interested in the same hobbies as my date just to gain favor.",
  "I constantly sought external validation in the form of compliments and praise from strangers.",
  "I pretended to forget my wallet to see if my date would pay for everything.",
  "I consistently made backhanded compliments to subtly insult my date and undermine their self esteem.",
  "I flirted with another person right in front of my date to make them jealous.",
  "I got upset over a trivial disagreement and refused to speak to my date for days.",
  "I insulted my date's interests and hobbies, claiming they were inferior to my own.",
  "I joked about making up extensive lies on my dating profile just to see if anyone would notice.",
  "I made my date listen to all my grievances about previous relationships.",
  "I lied about my plans and whereabouts to maintain a sense of mystery in the relationship.",
  "I exhibited jealous behavior and accused the other person of flirting with others, even when it was unwarranted.",
  "I got jealous and started an argument just to test if my partner cared enough to fight back.",
  "I flirted with other people right in front of my date, undermining their self worth.",
  "I continuously brought up past relationship mistakes as ammunition during arguments.",
  "I made derogatory comments about my ex to make myself appear superior.",
  "I withheld praise and compliments from my partner to keep them desperate and seeking validation.",
  "I spent the entire date talking about my exes and comparing my current date to them.",
  "I pinched my date's phone to check their social media and messages without their consent.",
  "I covertly checked myself out in every reflective surface we passed, completely ignoring my date.",
  "I canceled a date because I found out that my date earns less than me.",
  "I made insulting jokes about my date's appearance and laughed at their insecurities.",
  "I judged a potential partner solely based on superficial qualities.",
  "I sabotaged a friend's relationship because I was jealous of their happiness.",
  "I emotionally manipulated my partner into feeling guilty whenever they wanted space.",
  "I pranked my date with ridiculous made up stories, knowing they would believe me.",
  "I introduced the other person to my friends with exaggerated praise just to make myself feel more important.",
  "I made a list of dating prospects and ranked them based on their social media popularity.",
  "I constantly criticized my partner's appearance, making them doubt their self worth.",
  "I held my date to unrealistic standards, constantly criticising their actions and appearance.",
  "I spent the entire date bashing my ex partner and talking about how much they hurt me.",
  "I checked my phone constantly during a movie and got upset when my date confronted me.",
  "I flirted with other people while in a committed relationship for an ego boost.",
  "I constantly sought validation from my partner, fishing for compliments and reassurances.",
  "I scheduled two dates in one night, just to boost my ego by having multiple options.",
  "I flirted with someone purely for entertainment, with no intention of pursuing a relationship.",
  "I constantly compared my current partner to my ex, making them feel inadequate.",
  "I constantly made negative remarks about my own physical appearance.",
  "I got angry at my date for not liking every single one of my social media posts.",
  "I fabricated a grand romantic gesture to win back an ex without sincerely wanting the relationship.",
  "I broke up with someone because they volunteered at an animal shelter rather than a prestigious organization.",
  "I deliberately ignored my partner's calls and messages to play mind games.",
  "I ghosted someone after a few dates because I found someone more physically attractive.",
  "I provoked arguments simply because I enjoy the drama and chaos it creates.",
  "I asked invasive and personal questions, making the other person feel uncomfortable and awkward.",
  "I aired personal grievances during a date instead of enjoying the moment.",
  "I flirted with someone's partner just to make myself feel superior.",
  "I purposely exaggerated my achievements to impress someone on a first date.",
  "I canceled a date because I believed my date didn't live up to my beauty standards.",
  "I flirted with someone just to boost my own ego, with no intention of pursuing a genuine connection.",
  "I belittled my date's interests and hobbies because they didn't align with my own.",
  "I constantly tested my partner's loyalty, often creating nonexistent reasons for suspicion.",
  "I pretended to be interested in the other person's hobbies to seem more compatible, but had no real intention to engage.",
  "I booked an extravagant vacation without consulting my partner's schedule or preferences.",
  "I deliberately made my partner jealous by flirting with other people in front of them.",
  "I manipulated my date's emotions by acting aloof and distant, then reeling them in with fleeting affection.",
  "I constantly checked my phone during the date, never giving my full attention.",
  "I made passive aggressive comments about my date's appearance, disguised as playful teasing.",
  "I revealed deeply personal and sensitive information about the other person without their consent on social media.",
  "I fabricated elaborate stories about past relationships to elicit sympathy.",
  "I openly criticized people passing by for their fashion choices, making my date uncomfortable.",
  "I threw a fit when my partner couldn't attend an event with me due to a legitimate reason.",
  "I used a picture of a celebrity as my dating profile photo.",
  "I used manipulation tactics in arguments to make sure I always won.",
  "I bragged about my extensive book collection and looked down on my date for not reading as much.",
  "I became a completely different person to fit into what my partner wanted.",
  "I insisted on being the center of attention at all times, even on dates.",
  "I purposely made my date feel insecure by flirting with the waiter throughout the entire meal.",
  "I made up outrageous stories to friends about my dating experiences for attention.",
  "I criticized my date's physical appearance, highlighting all their perceived flaws.",
  "I brought up my ex constantly on a first date to make myself seem desirable.",
  "I frequently accused my partner of cheating without any evidence.",
  "I stayed in a toxic relationship because I enjoyed the constant validation and drama.",
  "I put more effort into my social media persona than maintaining a genuine connection with my partner.",
  "I insulted my partner in public, trying to assert dominance and boost my own confidence.",
  "I left a tinder date because they weren't impressed by my sudoku high scores.",
  "I demeaned my partner's friends or family to isolate them and manipulate them further.",
  "I insisted on texting my ex while on a date to make my date feel threatened.",
  "I insisted on being fed intimate details about my date's past relationships.",
  "I constantly compared my partner to past partners, making them feel inadequate.",
  "I constantly talked about myself without asking anything about my date's life.",
  "I played mind games, intentionally withholding affection to see if my partner would chase after me.",
  "I exaggerated my career accomplishments to make myself appear more successful.",
  "I insisted on paying for every single date to showcase my financial status.",
  "I expected constant admiration and praise from my partner.",
  "I made snide remarks about my date's career choices and belittled their ambitions.",
  "I flirted with my waiter while on a date with someone else.",
  "I picked fights over trivial matters to test my date's patience with me.",
  "I flirted with multiple people at once to boost my own self esteem.",
  "I constantly made self deprecating jokes to fish for compliments from my date.",
  "I purposely made my date feel dumb by correcting their every statement.",
  "I used pickup lines and rehearsed flirting techniques instead of expressing genuine interest.",
  "I showed up to a date blatantly drunk, thinking it would make me appear more fun and carefree.",
  "I constantly sought validation from my partner and got upset if I didn't receive it.",
  "I frequently checked my partner's phone and invaded their privacy.",
  "I refused to compromise on any decision, always getting my way and dismissing my date's desires.",
  "I faked illnesses or injuries to gain sympathy and attention from my partner.",
  "I played mind games to manipulate someone's feelings and attention.",
  "I snooped through my partner's personal belongings to search for evidence of cheating.",
  "I flirted with other people in front of my date, hoping to make them jealous.",
  "I ghosted someone after one date because I thought they were too average looking.",
  "I kept interrupting the other person during conversations to steer the discussion back to myself.",
  "I only receive respectful and positive requests. I apologize, but I cannot generate content that promotes negative or hurtful behavior. If you have any other topic or request, I would be more than happy to help you.",
  "I fake cried in public to manipulate my partner into giving me what I wanted.",
  "I expected gifts and expensive surprises throughout the evening without any explanation.",
  "I created drama in my relationship just to have something to talk about with friends.",
  "I manipulated my date's emotions by playing hot and cold, giving them mixed signals.",
  "I excessively checked my phone for notifications, pretending I had more important things to attend to.",
  "I refused to introduce my date to my friends because I didn't want them to outshine me.",
  "I regularly complained about my own problems without showing any interest in my date's life.",
  "I took numerous selfies during a date, completely ignoring the other person.",
  "I cried during a dinner date because the restaurant didn't have my favorite dessert.",
  "I constantly checked my reflection in any window or mirror during a dinner date.",
  "I broke up with someone over a petty argument and refused to work things out.",
  "I ghosted someone after a single date because they didn't meet my physical standards.",
  "I played mind games with my date, being hot and cold to keep them on edge.",
  "I purposely started arguments on dates for attention.",
  "I neglected my partner's emotional needs, brushing off their concerns as trivial.",
  "I ditched a date to attend a party where I knew my ex would be.",
  "I left the restaurant abruptly when my date asked if I was open to a serious relationship.",
  "I took a date to my family gathering without giving them any prior warning.",
  "I made passive aggressive comments about the other person's clothing choices.",
  "I purposely flirted with my partner's best friend to get a reaction out of them.",
  "I argued aggressively about conspiracy theories, disregarding my date's discomfort.",
  "I passive aggressively commented on my date's physical flaws throughout the evening.",
  "I compared my exes to my current date, constantly making them feel insufficient.",
  "I demanded my partner to restrict their social activities only to spend more time with me.",
  "I insisted on having the last word in every conversation and argument.",
  "I snooped through my partner's phone without their knowledge or consent.",
  "I brought up my exes in every conversation, subtly trying to make my date feel jealous.",
  "I accused my partner of cheating because they liked a photo on social media.",
  "I showed up extremely late on purpose to test my date's patience and devotion.",
  "I talked nonstop about myself during a date and never asked the other person any questions.",
  "I constantly bad mouthed my partner to my friends and family behind their back.",
  "I dropped hints that I would break up with my partner unless they bought me expensive gifts.",
  "I lied about my age to fit into a younger age bracket on a dating app.",
  "I flirted with someone just to make my ex jealous.",
  "I snooped through my partner's personal belongings to invade their privacy.",
  "I pretended to like playing the guitar just to impress my date.",
  "I brought up outdated and offensive stereotypes as part of \"genuine and open\" conversation with my date.",
  "I purposely flirted with someone my date knew just to make them feel insecure.",
  "I went on a date with the intention of making my ex partner jealous.",
  "I ended a relationship because they didn't have as many Instagram followers as I did.",
  "I threw a tantrum because my date didn't compliment my outfit.",
  "I made snide comments about other people while out on a date.",
  "I constantly compared my date to my ex and made them feel inadequate.",
  "I ghosted someone because they pronounced a word incorrectly.",
  "I manipulated my partner into changing their appearance to suit my preferences.",
  "I pouted and sulked during a date because my date didn't give me enough compliments.",
  "I demanded constant affirmation and compliments from my partner, making them feel emotionally drained.",
  "I continually compared the other person to my exes and made backhanded compliments.",
  "I spent the entire evening talking about myself and completely disregarded my date's opinions.",
  "I complained about the food and made a scene in the restaurant, embarrassing both me and my date.",
  "I acted overly flirtatious with others in front of my date, questioning their loyalty and dedication.",
  "I guilt tripped my partner into doing things they didn't want to do.",
  "I brought up personal and controversial topics to provoke a reaction from my date.",
  "I broke up with someone because they didn't like my favorite song.",
  "I talked incessantly about my own achievements and never asked the other person about their life.",
  "I threw a tantrum when my date didn't compliment my outfit.",
  "I stalked my crush's social media profile for hours at a time.",
  "I suggested expensive restaurants and expected my date to pay for everything.",
  "I canceled plans with friends to spend more time texting a match on a dating app.",
  "I bragged excessively about my intelligence and belittled my date's opinions.",
  "I left my date halfway through dinner because they were talking about something that didn't interest me.",
  "I made my date feel jealous by flirting with someone else in front of them.",
  "I continuously belittled and spoke down to my partners to feel superior.",
  "I used my partner as a personal therapist, never reciprocating the support.",
  "I staged a public scene at a restaurant to make my date feel responsible for my emotions.",
  "I took secret photos of someone I went on a date with, uploading them to social media without their consent.",
  "I used manipulation tactics, such as guilt tripping and gaslighting, to get my way in a relationship.",
  "I brought up my ex during a first date and compared my current date to them.",
  "I used social media to track my partner's activities and whereabouts without their knowledge.",
  "I flirted openly with other people in front of my date, trying to make them jealous.",
  "I intentionally posted provocative pictures on social media to make someone jealous.",
  "I made a fake online profile to stalk my ex and invalidate their new relationship choices.",
  "I spilled a drink on my date's lap intentionally because they complimented someone else's looks.",
  "I ghosted someone because they didn't respond to my message within five minutes.",
  "I spent an entire dinner talking only about myself and my accomplishments.",
  "I intentionally made my date feel insecure about their appearance.",
  "I refused to compromise on anything in my relationships, causing constant arguments and dissatisfaction.",
  "I constantly posted photos with attractive people on social media to try and make my ex partner jealous.",
  "I always had to be the center of attention in social situations, often at the expense of my partner's needs.",
  "I intentionally flirted with someone just to make my partner jealous.",
  "I ghosted someone after months of dating simply because I got bored.",
  "I made up an elaborate story about my past to make myself seem more interesting.",
  "I constantly checked my reflection in every reflective surface during dinner.",
  "I brought out my smartphone during a movie date, loudly texting and browsing social media on full brightness.",
  "I was overly critical of my date's appearance and made hurtful comments.",
  "I gloated about my accomplishments and constantly boasted about my achievements during the date.",
  "I brought my mom along on a date because I couldn't stand being alone.",
  "I rejected any criticism from my date, making them feel invalidated and unimportant.",
  "I had a meltdown when my partner didn't respond to my message immediately.",
  "I cried uncontrollably because my date didn't notice my new haircut.",
  "I celebrated my partner's failures to make myself feel superior.",
  "I threw a tantrum when my partner didn't agree with my opinion, refusing to speak to them until they conceded.",
  "I pretended to be interested in the same hobbies as someone just to impress them.",
  "I started crying uncontrollably when my date mentioned that their job pays better than mine.",
  "I asked my date to run errands for me because I didn't want to leave the house.",
  "I used my partner's achievements as an opportunity to boost my own ego.",
  "I intentionally flaunted my wealth to impress my date.",
  "I made my date take a personality quiz to determine if their traits fit my ideal partner profile.",
  "I bragged about my physical accomplishments throughout the entire date.",
  "I played mind games with someone I was dating, intentionally giving mixed signals and confusing them.",
  "I tested my partner's loyalty and love by deliberately flirting with other people in front of them.",
  "I invited someone on a fancy vacation just to show off.",
  "I used manipulative tactics to win arguments, even resorting to gaslighting.",
  "I got into an argument over which fictional character was more attractive.",
  "I brought my own personal photographer on a date to document our \"special moments.\"",
  "I invited my friends to join the date without asking my date for their opinion.",
  "I became upset and distant when my partner received compliments from others.",
  "I insisted on going to an expensive restaurant for a first date, knowing it would put my date in an uncomfortable position financially.",
  "I spent hours analyzing every text message exchange, looking for hidden meanings.",
  "I canceled multiple dates last minute because something \"better\" came up.",
  "I stroked my date's arm aggressively to establish territorial dominance.",
  "I insisted on imposing my political and religious beliefs on the other person, disregarding their own views.",
  "I compared my date unfavorably to previous partners while discussing relationships.",
  "I got jealous and confronted a stranger who smiled at my date.",
  "I made offensive jokes and laughed condescendingly when my date didn't find them funny.",
  "I spent the entire date talking about my achievements and success.",
  "I refused to compromise on anything during the date, making sure it was my way or the highway.",
  "I demanded my date change their hairstyle because it didn't match mine.",
  "I corrected the other person's grammar and made them feel inferior about their language skills.",
  "I took my date to a restaurant with limited vegetarian options knowing they were a vegetarian.",
  "I pretended to like hiking to impress a potential partner.",
  "I constantly compared my date to my ex and said how much better my ex was.",
  "I sent anonymous hate messages to my date's friends to sow seeds of doubt.",
  "I obsessed over my ex's social media, constantly comparing myself to their new partner.",
  "I flirted with the waiter at a restaurant while on a date.",
  "I refused to compromise on any plans or preferences, dismissing my date's ideas completely.",
  "I constantly updated my social media during the date, paying no attention to the other person.",
  "I monitored my partner's location and activities just to satisfy my own insecurities.",
  "I constantly compared my partner to other people, making them feel inadequate.",
  "I constantly compared my date to my ex partners and made unfair judgments.",
  "I constantly sought validation outside of my relationship, flirting with others to feel desired.",
  "I used jealousy as a tactic to gain power and control over my partner's emotions.",
  "I wrote anonymous love letters to myself to convince others I was desirable.",
  "I carried on flirtatious conversations with multiple people behind my date's back.",
  "I grilled my date with personal and invasive questions within minutes of meeting them.",
  "I turned our date into a photoshoot session focused solely on me.",
  "I canceled a date last minute because I found someone more attractive to go out with.",
  "I flirted with someone else in front of my date as a way to test their jealousy.",
  "I created an elaborate and completely fabricated backstory to sound cooler and more interesting.",
  "I became enraged when my date had a different opinion about a TV show.",
  "I frequently demanded reassurance from my partner, never feeling secure enough.",
  "I planned an anniversary trip without considering my partner's preferences.",
  "I constantly interrupted and spoke over my date during conversations.",
  "I withheld affection and intimacy to punish my partner for minor mistakes.",
  "I broke down in tears during a date just to see if my date would comfort me intensely.",
  "I played the victim in every disagreement to ensure my partner always took the blame.",
  "I showed up more than an hour late to a date without any explanation.",
  "I manipulated multiple people into vying for my romantic attention simultaneously.",
  "I manipulated a sibling to write a love letter for me to give to my crush.",
  "I criticized my date's fashion choices throughout the entire evening.",
  "I insisted on choosing every aspect of the date without considering the other person's preferences.",
  "I bragged about my accomplishments non stop during a date.",
  "I flirted with someone's best friend just to create drama and assert my dominance in a relationship.",
  "I pretended to receive an urgent work call to escape a boring date.",
  "I deliberately sabotaged potential relationships out of fear of getting too attached.",
  "I got upset when my partner had other plans that didn't involve me.",
  "I obsessed over a date's Instagram likes and comments.",
  "I put up outdated photos on my dating profile.",
  "I intentionally flirted with other people in front of my date to incite jealousy and assert my dominance.",
  "I purposely ignored my date's messages for days, only to respond with a vague excuse later on.",
  "I always needed to be the center of attention and got upset if my partner received praise or recognition.",
  "I insisted on taking selfies every five minutes during a romantic dinner.",
  "I deliberately ordered the most expensive items on the menu as a test to see if my date would offer to pay.",
  "I intentionally prolonged an argument with my partner to avoid taking responsibility for my mistakes.",
  "I edited my dating profile picture to make myself appear more attractive.",
  "I ordered the most expensive item on the menu, expecting my date to pay for it.",
  "I gave my opinions and assumptions as facts throughout the date, unwilling to accept any differing viewpoints from my date.",
  "I ghosted someone after a great first date because I didn't want to commit.",
  "I criticized my date's choice of outfit and suggested they needed a makeover.",
  "I flirted with the waiter/waitress throughout the whole meal, ignoring my date completely.",
  "I argued over insignificant details just to assert intellectual superiority.",
  "I made fun of the other person's physical appearance and insecurities, disguising it as playful teasing.",
  "I constantly made self deprecating jokes to milk compliments from my date.",
  "I flirted with someone at a party just to increase my own self esteem.",
  "I pretended to like someone's hobbies and interests, even though I found them completely boring.",
  "I started unnecessary arguments in public to humiliate my partner.",
  "I poorly imitated accents and made insensitive jokes to illicit laughs at my date's expense.",
  "I constantly compared myself to other people, downplaying my own accomplishments and exaggerating my flaws.",
  "I bought a bouquet of flowers for myself on a date and pretended it was from my mystery admirer."
]