[
  "I went on a date with someone who only communicated in rhymes and required responses in kind.",
  "I went on a date with someone who brought their own pack of tarot cards and insisted on reading my future.",
  "I went on a date with someone who insisted on playing \"truth or dare\" the entire time, including giving each other dares like stealing cutlery from nearby tables.",
  "I went on a date with someone who was convinced they were a vampire and constantly asked if they could taste my blood.",
  "I went on a date with someone who brought a metal detector and insisted on searching for buried treasure.",
  "I went on a date with someone who brought a portable bubble machine and insisted on sitting underneath a cloud of bubbles the entire time.",
  "I went on a date with someone who claimed to have invented a brand new type of toothpaste made from mashed potatoes.",
  "I went on a date with someone who collected discarded chewing gum from the streets to",
  "I went on a date with someone who believed they had psychic abilities and insisted on giving me readings throughout the night.",
  "I went on a date with someone who only communicated by reciting Shakespearean sonnets.",
  "I went on a date with someone who asked me to participate in their performance art piece about modern dating.",
  "I went on a date with someone who had a full on puppet show prepared and insisted that we both participate.",
  "I went on a date with someone who brought their mom along to approve of me.",
  "I went on a date with someone who claimed to be an expert in deciphering alien hieroglyphics.",
  "I went on a date with someone who constantly referred to themselves in the third person.",
  "I went on a date with someone who insisted on speaking in a made up language they had created.",
  "I went on a date with someone who wanted to create a vision board of our future before we even knew each other's last names.",
  "I went on a date with someone who insisted on speaking only in song lyrics.",
  "I went on a date with someone who believed they were a time traveler and tried to convince me we had already been married in the future.",
  "I went on a date with someone who had an obsession with collecting rubber ducks.",
  "I went on a date with someone who carried a plastic eel in their pocket and whispered their deepest secrets to it.",
  "I went on a date with someone who never stopped talking about their ex and all the ways they were superior to them.",
  "I went on a date with someone who brought a suitcase full of plush toys and insisted on reenacting scenes from their favorite cartoons.",
  "I went on a date with someone who had a collection of exotic rocks they insisted on showing me and discussing at length.",
  "I went on a date with someone who insisted on wearing a Viking helmet for the entire evening because they believed it was lucky.",
  "I went on a date with someone who brought a suitcase filled with puppets and insisted we reenact scenes from famous movies.",
  "I went on a date with someone who owned a pet tarantula and insisted on letting it crawl on my arm.",
  "I went on a date with someone who ordered an entire pizza to themselves but would only eat the toppings and leave the crust.",
  "I went on a date with someone who wore a shirt covered in cat hair and claimed they were allergic to actual cats.",
  "I went on a date with someone who exclusively communicated through a series of animal noises.",
  "I went on a date with someone who insisted on conducting a job interview instead.",
  "I went on a date with someone who talked about their future wedding and names for our future children in the first ten minutes.",
  "I went on a date with someone who had a shrine dedicated to Nicolas Cage in their living room.",
  "I went on a date with someone who couldn't stop mentioning their extensive collection of toenail clippings.",
  "I went on a date with someone who insisted on demonstrating their world class ability to eat an entire watermelon in one sitting.",
  "I went on a date with someone who couldn't stop talking about their imaginary friend named Mr. Snuggles.",
  "I went on a date with someone who had a phobia of sitting down and insisted on standing for the entirety of our dinner.",
  "I went on a date with someone who insisted on eating their food only with chopsticks, even though we were at a steakhouse.",
  "I went on a date with someone who constantly carried around a stack of tarot cards and would only communicate through their mystical interpretations.",
  "I went on a date with someone who had a panic attack every time a siren passed nearby.",
  "I went on a date with someone who brought their life size cardboard cutout of a celebrity and treated it like a third wheel.",
  "I went on a date with someone who kept a jar of their own toenail clippings as a memento and proudly showed it to me.",
  "I went on a date with someone who had a passion for extreme couponing and spent the night discussing their incredible bargains.",
  "I went on a date with someone who brought their life sized cardboard cutout of their ex as a conversation starter.",
  "I went on a date with someone who randomly burst into interpretive dance in the middle of our meal.",
  "I went on a date with someone who had an obsession with collecting toenail clippings, and wanted to compare them with mine.",
  "I went on a date with someone who insisted on singing their responses instead of speaking.",
  "I went on a date with someone who brought their own personal ghostbuster equipment, claiming to sense supernatural beings around us.",
  "I went on a date with someone who kept referring to themselves as a \"professional cuddler\"",
  "I went on a date with someone who had a pet snake that they insisted on wearing as a necklace.",
  "I went on a date with someone who insisted on playing a game of \"rock, paper, scissors\" to make every decision throughout the evening.",
  "I went on a date with someone who was convinced they were a superhero and tried to demonstrate their abilities by jumping off a park bench.",
  "I went on a date with someone whose main topic of conversation was their extensive collection of toenail clippings.",
  "I went on a date with someone who had an overwhelming fear of balloons.",
  "I went on a date with someone who whipped out a guitar and serenaded me with a death metal love song.",
  "I went on a date with someone who claimed to be a vampire and insisted on sipping their drink through a straw because they couldn't consume solid food.",
  "I went on a date with someone who had a deep fascination for collecting belly button lint.",
  "I went on a date with someone who only communicated using Morse code.",
  "I went on a date with someone who insisted on wearing a clown costume and refused to take it off.",
  "I went on a date with someone who carried a metal detector everywhere we went and stopped to dig every time it beeped.",
  "I went on a date with someone who brought an emergency survival kit, just in case.",
  "I went on a date with someone who believed they were a descendent of ancient Egyptian pharaohs.",
  "I went on a date with someone who insisted on role playing as a talking dolphin throughout the evening.",
  "I went on a date with someone who adopted a fake British accent for the entirety of the evening.",
  "I went on a date with someone who claimed to be a time traveler taking a break from saving humanity.",
  "I went on a date with someone who constantly quoted obscure lines from cult classic movies and expected me to join in.",
  "I went on a date with someone who had an obsession with collecting used chewing gum and had a secret stash hidden in their pocket.",
  "I went on a date with someone who showed up with a full PowerPoint presentation about why we should be together.",
  "I went on a date with someone who believed they were clairvoyant and tried to predict our future together.",
  "I went on a date with someone who insisted that we communicate only through Morse code.",
  "I went on a date with someone who brought their pet snake to the restaurant and let it crawl all over the table.",
  "I went on a date with someone who brought a fortune teller to predict our future as a couple.",
  "I went on a date with someone who brought a PowerPoint presentation to explain why they were the perfect partner for me.",
  "I went on a date with someone who brought their personal cryptic crossword puzzle to solve together.",
  "I went on a date with someone who insisted on role playing as superheroes throughout the entire evening.",
  "I went on a date with someone who brought a stack of their mom's homemade scrapbooks and forced me to go through every single page.",
  "I went on a date with someone who had an extensive collection of clown themed porcelain dolls.",
  "I went on a date with someone who collected bellybutton lint as a hobby.",
  "I went on a date with someone who insisted on speaking exclusively in rhymes, making conversation quite challenging.",
  "I went on a date with someone who showed up wearing a full body chicken costume.",
  "I went on a date with someone who ordered nothing but the spiciest dishes on the menu and proceeded to eat them without breaking a sweat.",
  "I went on a date with someone who was convinced that they were a vampire and asked if they could drink my blood.",
  "I went on a date with someone who could only speak in Shakespearean sonnets.",
  "I went on a date with someone who showed up wearing a full clown costume, complete with oversized shoes and a red nose.",
  "I went on a date with someone who was fascinated by body odors and wanted to compare and rate the scents of everyone around us.",
  "I went on a date with someone who was convinced they were a reincarnation of a famous historical figure.",
  "I went on a date with someone who brought their taxidermy collection to show off.",
  "I went on a date with someone who brought their extensive collection of taxidermied animals to show off.",
  "I went on a date with someone who took me to a taxidermy museum for a romantic stroll.",
  "I went on a date with someone who had an uncontrollable habit of using air quotes for every single sentence, even when unnecessary.",
  "I went on a date with someone who brought along their collection of commemorative spoons from different countries.",
  "I went on a date with someone who claimed to be an alien from the planet Zorgon and asked me to help them save the world.",
  "I went on a date with someone who ordered only the spiciest food available and insisted that we have a \"spicy food challenge.\"",
  "I went on a date with someone who believed they were being constantly watched by undercover spies, even in a restaurant.",
  "I went on a date with someone who carried around a magnifying glass and would use it to inspect everything on their plate.",
  "I went on a date with someone who swore by the healing power of crystals and insisted on giving me a crystal reading.",
  "I went on a date with someone who only spoke in rhymes, making every conversation quite awkward.",
  "I went on a date with someone who brought a pet parrot that repeated everything we said, making for awkward conversations.",
  "I went on a date with someone who brought a ventriloquist dummy along and refused to let anyone else speak.",
  "I went on a date with someone who carried around a voodoo doll of their ex.",
  "I went on a date with someone who brought their pet parrot along and insisted on teaching it offensive words throughout the night.",
  "I went on a date with someone who brought pamphlets about joining their religious cult and started proselytizing during dessert.",
  "I went on a date with someone who had a shrine dedicated to their favorite professional wrestler in their bedroom.",
  "I went on a date with someone who brought their pet snake and insisted on introducing us to each other.",
  "I went on a date with someone who collected expired supermarket coupons and treated them like rare trading cards.",
  "I went on a date with someone who brought a whiteboard and markers to keep track of our conversation points.",
  "I went on a date with someone who had a collection of creepy porcelain dolls and made them all sit at the dinner table.",
  "I went on a date with someone who brought their collection of taxidermy animals as conversation starters.",
  "I went on a date with someone who had a \"Cat Lady\" tattoo on their forehead, despite not owning any cats.",
  "I went on a date with someone who carried a mini harmonica and played it at random moments.",
  "I went on a date with someone who brought their collection of taxidermy animals to dinner.",
  "I went on a date with someone who thought they were a vampire and insisted on drinking tomato juice instead of wine.",
  "I went on a date with someone who would randomly break into interpretive dance routines in public places.",
  "I went on a date with someone who had a collection of action figures and insisted on bringing them to the restaurant, staging epic battles on the table.",
  "I went on a date with someone who had an obsession with collecting vintage clown paintings and insisted on showing me their extensive collection.",
  "I went on a date with someone who wanted to reenact the entire “Titanic” movie on our first date, including the sinking scene.",
  "I went on a date with someone who had an obsession with collecting rubber ducks and insisted on bringing their entire collection to dinner.",
  "I went on a date with someone who treated their pet rock as if it were their child.",
  "I went on a date with someone who showed up wearing a full astronaut suit.",
  "I went on a date with someone who believed they were the reincarnation of Cleopatra and demanded to be treated like royalty.",
  "I went on a date with someone who showed up with a clipboard and conducted a detailed survey about our compatibility.",
  "I went on a date with someone who carried around a giant magnifying glass and examined everything they came across, hoping to stumble upon a mystery.",
  "I went on a date with someone who had a miniature shrine dedicated to their favorite celebrity in their living room.",
  "I went on a date with someone who asked me to inspect the alignment of their chakras and assess their energy levels.",
  "I went on a date with someone who believed they were being followed by a curse and insisted on performing purification rituals throughout the evening.",
  "I went on a date with someone who had a pet python and made it jewelry out of its shedded skin.",
  "I went on a date with someone who had a phobia of plants and screamed every time we passed a flower shop.",
  "I went on a date with someone who physically measured my facial features to determine if we were \"compatible\" on an aesthetic level.",
  "I went on a date with someone who strongly believed in lizard people conspiracies and tried to recruit me into their cult.",
  "I went on a date with someone who showed up wearing a full clown costume, complete with a red nose and oversized shoes.",
  "I went on a date with someone who exclusively communicated through Morse code using a flashlight.",
  "I went on a date with someone who showed up dressed as a pirate and insisted on speaking in an exaggerated pirate accent.",
  "I went on a date with someone who insisted on playing an intense game of chess, with each move requiring a five minute meditation.",
  "I went on a date with someone who showed up wearing a helmet, ready for a spontaneous chin up competition.",
  "I went on a date with someone who brought their pet snake and let it slither across the table during dinner.",
  "I went on a date with someone who asked me to fill out a 100 question compatibility quiz that they had designed before we even ordered drinks.",
  "I went on a date with someone who brought a bag of live crickets to release in the restaurant for \"ambiance.\"",
  "I went on a date with someone who had a collection of taxidermy rodents that they dressed up in different costumes.",
  "I went on a date with someone who had a shrine dedicated to their favorite celebrity in their bedroom.",
  "I went on a date with someone who kept reciting Shakespearean monologues as pick up lines.",
  "I went on a date with someone who thought it would be romantic to bring their own personalized gravestone as a gift.",
  "I went on a date with someone who believed they were the chosen one to save humanity.",
  "I went on a date with someone who couldn't stop talking about their extensive collection of taxidermied animals.",
  "I went on a date with someone who believed they were a superhero and insisted on patrolling the streets for criminals during our date.",
  "I went on a date with someone who insisted on communicating only in Morse code to add an \"element of mystery\" to our interactions.",
  "I went on a date with someone who brought their psychic medium to analyze our compatibility.",
  "I went on a date with someone who only communicated through a series of intricate hand gestures and facial expressions.",
  "I went on a date with someone who brought a bag of fortune cookies and insisted on eating them all for \"extra luck\".",
  "I went on a date with someone who believed they were the reincarnation of Elvis Presley and would only respond to \"The King\".",
  "I went on a date with someone who showed up with a metal detector and insisted on looking for buried treasure at the park.",
  "I went on a date with someone who wore a tinfoil hat because they believed in mind reading aliens.",
  "I went on a date with someone who claimed to have a direct line to the spirit world and asked if I wanted to speak with my deceased great aunt.",
  "I went on a date with someone who brought a pocket sized voodoo doll and whispered mysterious incantations to it throughout the evening.",
  "I went on a date with someone who thought it was perfectly acceptable to eat butter straight from the tub.",
  "I went on a date with someone who had a peculiar talent of balancing various objects on their nose and attempted to impress me with their skills.",
  "I went on a date with someone who brought their pet snake along for a romantic walk in the park.",
  "I went on a date with someone who brought their own personal fog machine to create a mysterious atmosphere.",
  "I went on a date with someone who insisted on wearing a full body unicorn costume.",
  "I went on a date with someone who insisted on role playing as a medieval knight the entire time.",
  "I went on a date with someone who brought their ventriloquist dummy and had conversations with it instead of me.",
  "I went on a date with someone who suggested we break into a zoo after hours for a unique experience.",
  "I went on a date with someone who wanted to create a joint vision board for our future, complete with cutouts from gossip magazines.",
  "I went on a date with someone who claimed they were fluent in a fictional alien language and tried to teach it to me.",
  "I went on a date with someone who had a personalized license plate that said \"4EVA AL1EN\".",
  "I went on a date with someone who tried to impress me by juggling knives at the park.",
  "I went on a date with someone who brought their collection of clown noses and insisted we wear them.",
  "I went on a date with someone who insisted on ordering for me without asking my preferences.",
  "I went on a date with someone who brought their homemade fortune telling tarot card deck and attempted to predict our relationship's future.",
  "I went on a date with someone who insisted on doing interpretive dance routines at random intervals throughout the evening.",
  "I went on a date with someone who challenged me to a thumb wrestling match every time there was a lull in conversation.",
  "I went on a date with someone who brought a head mounted GoPro and insisted on recording the entire evening for their vlog.",
  "I went on a date with someone who believed they had the power to control traffic lights with their mind.",
  "I went on a date with someone who brought a portable karaoke machine and sang love ballads throughout our entire date.",
  "I went on a date with someone who claimed they could communicate with aliens telepathically and spent the evening staring at the sky waiting for a message.",
  "I went on a date with someone who kept a collection of taxidermied animals in their living room and insisted on talking to them throughout dinner.",
  "I went on a date with someone who greeted me with a love poem they had written about our future together.",
  "I went on a date with someone who had an unhealthy obsession with taxidermied squirrels and wanted to display them all over their house.",
  "I went on a date with someone who insisted on having a staring contest throughout the entire date.",
  "I went on a date with someone who insisted we role play as characters from Star Wars.",
  "I went on a date with someone who brought a mini fan to blow wind romantically in their face at all times.",
  "I went on a date with someone who took me to a cemetery for a picnic lunch.",
  "I went on a date with someone who kept reciting Shakespearean sonnets throughout dinner.",
  "I went on a date with someone who brought their own set of custom made vampire teeth and wore them throughout dinner.",
  "I went on a date with someone who decided to challenge me to a staring contest instead of having a conversation.",
  "I went on a date with someone who brought a pack of tarot cards to predict the future of our relationship.",
  "I went on a date with someone who insisted on role playing as characters from a horror movie throughout the evening.",
  "I went on a date with someone who constantly referred to themselves as",
  "I went on a date with someone who took out a spreadsheet to calculate the compatibility of our star signs.",
  "I went on a date with someone who brought a set of tarot cards and insisted on giving me a reading to determine our relationship potential.",
  "I went on a date with someone who carried around a backpack full of glow sticks and wouldn't stop twirling them around.",
  "I went on a date with someone who insisted on speaking in Shakespearean English the entire night.",
  "I went on a date with someone who collected used Band Aids as a hobby.",
  "I went on a date with someone who had an overly detailed PowerPoint presentation about why we should immediately adopt their favorite conspiracy theory.",
  "I went on a date with someone who claimed to communicate with aliens and spent the entire night talking about their intergalactic adventures.",
  "I went on a date with someone who insisted on reenacting scenes from their favorite soap opera throughout the night.",
  "I went on a date with someone who insisted on wearing a full hazmat suit because they were convinced the restaurant was contaminated.",
  "I went on a date with someone who constantly referred to themselves in third person and insisted I do the same.",
  "I went on a date with someone who insisted on arm wrestling everyone we encountered during our night out.",
  "I went on a date with someone who brought their ventriloquist doll and had conversations with it as if it were a real person.",
  "I went on a date with someone who took me to a taxidermy workshop and asked me to help stuff a squirrel.",
  "I went on a date with someone who thought it would be romantic to serenade me with their rendition of the Barney theme song.",
  "I went on a date with someone who started reciting love poems they had written about our hypothetical future together.",
  "I went on a date with someone who showed up in a full suit of medieval armor and refused to take it off, claiming it was their \"date armor.\"",
  "I went on a date with someone who broke down crying when they found out I didn't like the same flavor of ice cream as them.",
  "I went on a date with someone who couldn't help but burst into uncontrollable laughter every time someone said the word \"pickle\".",
  "I went on a date with someone who serenaded me with death metal songs throughout dinner.",
  "I went on a date with someone who serenaded me with love songs written entirely about their obsession with potted plants.",
  "I went on a date with someone who took me to an abandoned building, claiming it was the most romantic spot in town.",
  "I went on a date with someone who had an obsession with collecting toenail clippings.",
  "I went on a date with someone who wore a life sized cardboard cutout of their favorite celebrity on their back the entire night.",
  "I went on a date with someone who claimed to be a professional mermaid and refused to be seen without their tail fin.",
  "I went on a date with someone who insisted on taking selfies every five minutes, even during dinner.",
  "I went on a date with someone who kept a collection of their own baby teeth as a sentimental keepsake.",
  "I went on a date with someone who brought a bubble machine everywhere they went and surrounded us with bubbles at all times.",
  "I went on a date with someone who only communicated through interpretive mime.",
  "I went on a date with someone who recorded every moment of our evening and provided a running commentary as if they were a sports commentator.",
  "I went on a date with someone who had a habit of wearing different animal masks and making animal noises at random moments.",
  "I went on a date with someone who insisted on carrying around a crystal ball for guidance.",
  "I went on a date with someone who believed they were a superhero and attempted to fight crime throughout the evening.",
  "I went on a date with someone who kept asking me if I believed in aliens and if I had any abduction experiences.",
  "I went on a date with someone who insisted on playing the accordion during every quiet moment to set the mood.",
  "I went on a date with someone who insisted on ordering everything on the menu and then wanted to take leftovers home for their pet snake.",
  "I went on a date with someone who showed up wearing a shirt with their own face printed on it.",
  "I went on a date with someone who brought along a therapist puppet to help facilitate our communication.",
  "I went on a date with someone who constantly quoted lines from obscure 80s movies.",
  "I went on a date with someone who brought their karaoke machine to serenade me right there in the restaurant.",
  "I went on a date with someone who brought their own set of tarot cards to determine our compatibility.",
  "I went on a date with someone who had a tattoo of their own face on their arm and proudly showed it off throughout the evening.",
  "I went on a date with someone who claimed to have invented their own language and insisted on speaking it throughout the night.",
  "I went on a date with someone who insisted on role playing as a zombie apocalypse survivor the entire night.",
  "I went on a date with someone who believed they were a werewolf and tried to convince me to join their pack.",
  "I went on a date with someone who brought their own DIY lie detector machine and insisted on using it throughout the evening.",
  "I went on a date with someone who claimed to be an alien ambassador from the planet Zog.",
  "I went on a date with someone who insisted on spoon feeding me throughout the entire dinner, claiming it was a romantic gesture.",
  "I went on a date with someone who recited the entire phonebook during dinner, claiming it was a hobby of theirs.",
  "I went on a date with someone who had a prophetic obsession and kept trying to predict our future together based on obscure signs.",
  "I went on a date with someone who proclaimed their undying love for me within the first five minutes.",
  "I went on a date with someone who claimed to be a psychic and tried to predict our future together.",
  "I went on a date with someone who constantly quoted movie lines and expected me to respond with the next line.",
  "I went on a date with someone who believed they were a reincarnated Egyptian pharaoh.",
  "I went on a date with someone who couldn't stop talking about their recent encounter with Bigfoot in the woods.",
  "I went on a date with someone who brought their pet parrot who constantly repeated everything we said, making conversation impossible.",
  "I went on a date with someone who was convinced they could talk to birds and insisted on having lengthy conversations with pigeons in the park.",
  "I went on a date with someone who was obsessed with collecting belly button lint.",
  "I went on a date with someone who brought a stack of celebrity gossip magazines and quizzed me on random facts throughout the night.",
  "I went on a date with someone who brought their pet snake and wanted us to go \"snake hunting\" in the park.",
  "I went on a date with someone who had a collection of rubber ducks and insisted we take a bath together with them.",
  "I went on a date with someone who brought their guitar and performed impromptu songs about our date in front of the whole restaurant.",
  "I went on a date with someone who brought their extensive collection of old dental tools for show and tell.",
  "I went on a date with someone who had an ancient artifact obsession and brought a cursed amulet along.",
  "I went on a date with someone who made me reenact scenes from their favorite soap opera in a crowded coffee shop.",
  "I went on a date with someone who carried around a voodoo doll and insisted on sharing the history",
  "I went on a date with someone who brought a metal detector to the park and insisted on searching for buried treasure throughout our time together.",
  "I went on a date with someone who insisted on picking at all the details of my childhood traumas.",
  "I went on a date with someone who had an elaborate conspiracy theory about why pigeons were spying on us.",
  "I went on a date with someone who carried around a pillow with a picture of their favorite celebrity's face on it.",
  "I went on a date with someone who consistently referred to themselves in the third person.",
  "I went on a date with someone who dressed up as a banana and sang show tunes in the middle of the street.",
  "I went on a date with someone who claimed to be a former spy and insisted on using secret code names throughout the entire evening.",
  "I went on a date with someone who started chanting in ancient languages whenever they got nervous and couldn't stop until the date was over.",
  "I went on a date with someone who took me to a discount store to buy matching onesies.",
  "I went on a date with someone who insisted on conducting the date entirely in pig Latin.",
  "I went on a date with someone who carried around a jar of sand from every beach they had visited.",
  "I went on a date with someone who believed they were a mermaid trapped in a human body and insisted on swimming in a fish tank during dinner.",
  "I went on a date with someone who showed up dressed as a clown and insisted on speaking only in rhymes.",
  "I went on a date with someone who wore a shirt displaying their entire family tree, complete with pictures.",
  "I went on a date with someone who brought their pet goldfish along in a tiny tank and talked to it like it was their best friend.",
  "I went on a date with someone who carried around a collection of plastic insects in their bag, occasionally releasing them as a joke.",
  "I went on a date with someone who believed they were a vampire and insisted on drinking only blood colored cocktails.",
  "I went on a date with someone who brought their therapy parrot, which kept repeating embarrassing phrases throughout the night.",
  "I went on a date with someone who had a collection of taxidermied squirrels as their conversation starters.",
  "I went on a date with someone who believed they were a time traveler and kept asking if I remembered seeing them in the future.",
  "I went on a date with someone who kept a collection of their own toenail clippings as a memento.",
  "I went on a date with someone who kept asking me random math problems to measure our compatibility.",
  "I went on a date with someone who brought their pet parrot and claimed it was their relationship counselor.",
  "I went on a date with someone who had a weird obsession with dressing up as famous historical figures for romantic encounters.",
  "I went on a date with someone who had a fear of silverware, so we had to eat our meal with our hands.",
  "I went on a date with someone who insisted on wearing a full suit of armor to the movies.",
  "I went on a date with someone who took me to a karaoke bar but only sang songs from children's TV shows.",
  "I went on a date with someone who insisted on bringing a sock puppet as their plus one.",
  "I went on a date with someone who kept interrupting our conversation to FaceTime with their cat.",
  "I went on a date with someone who wore a full hazmat suit throughout the entire evening, citing \"germophobia\".",
  "I went on a date with someone who constantly talked about their obsession with collecting toenail clippings.",
  "I went on a date with someone who brought a whiteboard and markers to diagram their intricate relationship theories.",
  "I went on a date with someone who believed they were a werewolf during a full moon.",
  "I went on a date with someone who showed up wearing a wedding dress and asked if I wanted to do a mock wedding ceremony in the park.",
  "I went on a date with someone who treated our dinner like a live cooking show, complete with commentary and audience participation.",
  "I went on a date with someone who had an unhealthy obsession with clowns and insisted on wearing clown makeup throughout the evening.",
  "I went on a date with someone who constantly talked about their ex and even showed me their extensive collection of breakup letters.",
  "I went on a date with someone who brought a PowerPoint presentation listing their relationship goals and milestones.",
  "I went on a date with someone who had a strong belief in astrology and insisted on reading my birth chart at the dinner table.",
  "I went on a date with someone who brought a magnifying glass and proceeded to examine my face for \"imperfections.\"",
  "I went on a date with someone who entertained me by juggling knives and fire torches in the park.",
  "I went on a date with someone who collected and wore different animal teeth as necklaces for good luck.",
  "I went on a date with someone who had an intense fascination with circus clowns and would not stop talking about them.",
  "I went on a date with someone who brought a metal detector and insisted on",
  "I went on a date with someone who brought a stack of self help books and tried to diagnose me with various personality disorders.",
  "I went on a date with someone who insisted on playing an intense game of laser tag in the middle of a fancy restaurant.",
  "I went on a date with someone who believed they were a mermaid trapped in a human body.",
  "I went on a date with someone who had a phobia of birds and would scream every time a pigeon came near us in the park.",
  "I went on a date with someone who continuously played an air guitar, ignoring any attempts at conversation.",
  "I went on a date with someone who brought a metal detector and spent the entire time searching for buried treasure at the park.",
  "I went on a date with someone who carried a pocket sized dictionary and corrected my grammar every few minutes.",
  "I went on a date with someone who casually mentioned their obsession with collecting toenail clippings.",
  "I went on a date with someone who had a personal mission to hug every tree they came across, which made for an interesting time in the park.",
  "I went on a date with someone who wore a tinfoil hat and claimed they could communicate with aliens.",
  "I went on a date with someone who insisted we only communicate using interpretive hair flipping.",
  "I went on a date with someone who had a bizarre obsession with collecting used chewing gum.",
  "I went on a date with someone who constantly pretended to take phone calls from famous celebrities to make themselves seem more important.",
  "I went on a date with someone who insisted we communicate only through interpretive dance for the entire evening.",
  "I went on a date with someone who only ate their food with their feet because they believed it enhanced the flavor.",
  "I went on a date with someone who believed they could communicate with aliens through interpretive dance.",
  "I went on a date with someone who insisted on speaking only in Pig Latin for the entire evening.",
  "I went on a date with someone who had a pet cockroach named Sir Reginald and wouldn't stop talking about their precious bug companion.",
  "I went on a date with someone who thought they were a vampire and asked if they could bite me.",
  "I went on a date with someone who wore a custom made suit made entirely out of banana peels.",
  "I went on a date with someone who showed up with a metal detector and said that finding buried treasure was their idea of a romantic afternoon.",
  "I went on a date with someone who believed they were a superhero and wore a cape everywhere.",
  "I went on a date with someone who had a fascination with extreme couponing and spent the evening passionately discussing their latest finds.",
  "I went on a date with someone who brought their own Tupperware container to put leftovers in, even though we were at a fine dining restaurant.",
  "I went on a date with someone who couldn't stop complimenting their own body odor.",
  "I went on a date with someone who had a collection of ceramic garden gnomes that they carried around in a backpack.",
  "I went on a date with someone who had a constant need to speak in rhymes and turned every conversation into a bizarre poetry jam.",
  "I went on a date with someone who brought their collection of miniature dollhouse furniture to the park.",
  "I went on a date with someone who brought their own set of table manners flashcards.",
  "I went on a date with someone who carried a potted plant with them everywhere because they believed it was their spirit guide.",
  "I went on a date with someone who wouldn't stop talking about their extensive collection of lint.",
  "I went on a date with someone who carried around a collection of different fake mustaches and changed them every hour.",
  "I went on a date with someone who claimed they could communicate with aliens and kept trying to channel extraterrestrial beings throughout dinner.",
  "I went on a date with someone who brought their collection of celebrity hair clippings and wanted me to guess whose hair was whose.",
  "I went on a date with someone who wore a sandwich board advertising themselves as a \"hot single ready to mingle.\"",
  "I went on a date with someone who had an irrational fear of the color blue.",
  "I went on a date with someone who insisted on playing a game of Twister in the middle of a fancy restaurant.",
  "I went on a date with someone who constantly talked about their imaginary friend and referred to them as their life partner.",
  "I went on a date with someone who carried around a small voodoo doll and occasionally whispered to it for guidance.",
  "I went on a date with someone who brought a customized \"Will you marry me?\" sign even though it was our first date.",
  "I went on a date with someone who brought a mood chart, asking me to assess their mood every five minutes.",
  "I went on a date with someone who took me to visit their extensive collection of commemorative spoons from around the world.",
  "I went on a date with someone who had an obsession with collecting belly button lint and excitedly showed me their impressive stash.",
  "I went on a date with someone who claimed to be a mad scientist and wanted to experiment on our love chemistry using a homemade potion.",
  "I went on a date with someone who brought their collection of toenail clippings as a \"gift\" for me.",
  "I went on a date with someone who kept a live scorpion as a pet and brought it with them in a small glass box.",
  "I went on a date with someone who had an irrational fear of the color yellow and refused to be near anything of that color.",
  "I went on a date with someone who believed they were the reincarnation of a famous historical figure.",
  "I went on a date with someone who insisted on conducting a seance in the middle of the restaurant.",
  "I went on a date with someone who brought a pet chicken and let it roam free, causing chaos amongst other diners.",
  "I went on a date with someone who insisted on playing a blood curdling scream soundtrack throughout the evening.",
  "I went on a date with someone who brought along their entire stamp collection and insisted on examining each stamp in detail.",
  "I went on a date with someone who had a phobia of using utensils and insisted on eating everything with their hands.",
  "I went on a date with someone who kept quoting lines from the Harry Potter books and insisting we were in a magical world.",
  "I went on a date with someone who insisted on speaking only in a made up language they created.",
  "I went on a date with someone who introduced me to their pet parrot, who kept screaming expletives throughout the evening.",
  "I went on a date with someone who had a fascination with aliens and spent the entire evening showing me their collection of UFO sighting reports.",
  "I went on a date with someone who couldn't stop talking about their recent spiritual awakening as a reincarnated squirrel.",
  "I went on a date with someone who insisted on taking selfies every five minutes, even during serious conversations.",
  "I went on a date with someone who brought their ventriloquist dummy and had it do all the talking.",
  "I went on a date with someone who kept referring to themselves in the third person, speaking as if they were their own personal narrator.",
  "I went on a date with someone who tried to impress me by claiming to be a direct descendant of Bigfoot.",
  "I went on a date with someone who asked me to help them write a breakup text message to their current partner.",
  "I went on a date with someone who had a shrine dedicated to their favorite reality TV show in their living room.",
  "I went on a date with someone who believed they were the reincarnation of Cleopatra and expected me to address them as such.",
  "I went on a date with someone who brought their collection of clown noses and asked me to try each one on.",
  "I went on a date with someone who collected hair samples from everyone they dated and asked if they could have a lock of my hair.",
  "I went on a date with someone who wanted to reenact famous movie death scenes throughout the entire evening.",
  "I went on a date with someone who treated their smartphone like a child and refused to take their eyes off it.",
  "I went on a date with someone who brought their pet snake along and let it slither around on the table.",
  "I went on a date with someone who brought their stuffed animal collection to dinner.",
  "I went on a date with someone who showed up with their entire collection of human teeth.",
  "I went on a date with someone who wore a tinfoil hat because they believed aliens were constantly watching us.",
  "I went on a date with someone who had a full on meltdown when their food was served without parsley garnish.",
  "I went on a date with someone who tried to convert me to a cult they were part of.",
  "I went on a date with someone who had a collection of toenail clippings displayed in a glass jar as a conversation starter.",
  "I went on a date with someone who showed up dressed as a medieval knight, expecting a jousting tournament.",
  "I went on a date with someone who took me to a cemetery for a romantic picnic.",
  "I went on a date with someone who believed they were the world champion in thumb wrestling and challenged every person that passed by our table.",
  "I went on a date with someone who claimed to be immortal and brought an hourglass to prove it.",
  "I went on a date with someone who whispered sweet nothings to their avocado toast instead of talking to me.",
  "I went on a date with someone who spent the entire evening talking in Shakespearean language.",
  "I went on a date with someone who collected used dental floss as a bizarre art installation.",
  "I went on a date with someone who brought their pet tarantula and introduced it as their \"emotional support animal.\"",
  "I went on a date with someone who would only communicate through Morse code.",
  "I went on a date with someone who brought their collection of taxidermied rodents to show off.",
  "I went on a date with someone who claimed they could communicate with plants and tried to serenade a flower during our meal.",
  "I went on a date with someone who had a pet snake and insisted on bringing it along to the restaurant.",
  "I went on a date with someone who believed they had the ability to communicate with squirrels telepathically.",
  "I went on a date with someone who requested that all of our activities be timed, as if we were in a race.",
  "I went on a date with someone who started casually discussing their plans to build an underground bunker for the impending apocalypse.",
  "I went on a date with someone who insisted on reading their poetry aloud in public places, regardless of the audience.",
  "I went on a date with someone who insisted on wearing a full body squirrel costume.",
  "I went on a date with someone who only ate peanut butter and jelly sandwiches for every meal.",
  "I went on a date with someone who brought a lie detector machine and asked me ridiculous personal questions throughout the evening.",
  "I went on a date with someone who wrote a love poem about me before we even met.",
  "I went on a date with someone who started every sentence with \"My astrologer said that...\"",
  "I went on a date with someone who thought they were reincarnated from a squirrel and kept mimicking their movements throughout the night.",
  "I went on a date with someone who would only eat food that was blended into a paste.",
  "I went on a date with someone who believed they were the long lost descendant of Cleopatra.",
  "I went on a date with someone who insisted on doing a puppet show with sock puppets they had brought along.",
  "I went on a date with someone who was convinced they were a werewolf and kept insisting we go on a moonlit hike during dinner.",
  "I went on a date with someone who showed up with a briefcase full of random objects and insisted we play a game to figure out what they were for.",
  "I went on a date with someone who showed up wearing a tinfoil hat, claiming protection from mind reading aliens.",
  "I went on a date with someone who brought their pet hamster along in a stroller and insisted on pushing it around during our walk.",
  "I went on a date with someone who carried a portable metal detector and insisted on scanning our meal for hidden treasures before eating.",
  "I went on a date with someone who had an unusual interest in collecting and cataloging toenail clippings.",
  "I went on a date with someone who believed they were a time traveler from the future and tried to convince me to join their mission.",
  "I went on a date with someone who insisted on speaking in Shakespearean English the entire time.",
  "I went on a date with someone who carried a portable bubble machine and insisted on being in a bubble at all times.",
  "I went on a date with someone who kept a jar of their own tears as a memento.",
  "I went on a date with someone who insisted on playing a game of chess in the middle of the restaurant.",
  "I went on a date with someone who wore a tinfoil hat throughout the entire evening, claiming it protected them from mind control.",
  "I went on a date with someone who measured our compatibility based on our astrological signs and insisted on checking ours mid date.",
  "I went on a date with someone who only communicated through interpretive dance.",
  "I went on a date with someone who spent the entire time talking about their extensive collection of toenail clippings.",
  "I went on a date with someone who took me to a cemetery to have a picnic among the tombstones.",
  "I went on a date with someone who insisted on eating their entire meal with their feet.",
  "I went on a date with someone who brought a jar filled with their own hair and asked me if I would like to contribute to it.",
  "I went on a date with someone who had an obsession with collecting toenail clippings and insisted on showing me their vast collection.",
  "I went on a date with someone who kept a pocketful of crickets and released them whenever there was a lull in conversation.",
  "I went on a date with someone who serenaded me with a ukulele in a fast food restaurant.",
  "I went on a date with someone who conducted a detailed interview about my thoughts on conspiracy theories instead of engaging in conversation.",
  "I went on a date with someone who insisted on reenacting scenes from their favorite anime in public places.",
  "I went on a date with someone who brought a collection of taxidermy animals to show off their \"unique\" taste in home decor.",
  "I went on a date with someone who brought a vial of their own blood and asked me to join them in a blood oath of eternal love.",
  "I went on a date with someone who claimed to be a professional ghost hunter and wanted to investigate the restaurant.",
  "I went on a date with someone who believed they could speak to plants and conducted conversations with the potted ones.",
  "I went on a date with someone who greeted me by presenting a PowerPoint presentation about their life goals and relationship expectations.",
  "I went on a date with someone who brought their collection of clown shoes to show off.",
  "I went on a date with someone who showed up with a collection of bones they claimed to be their ancestors, proceeding to explain their family tree in detail.",
  "I went on a date with someone who thought they were a Disney prince/princess and expected me to play along.",
  "I went on a date with someone who thought it was perfectly normal to eat pizza with a knife and fork, even though we were in a casual pizzeria.",
  "I went on a date with someone who showed up with a full PowerPoint presentation on why we were meant to be together.",
  "I went on a date with someone who thought it was fun to wear matching banana costumes and go around peeling and eating bananas.",
  "I went on a date with someone who insisted on whispering every word they said, no matter the environment.",
  "I went on a date with someone who couldn't stop talking and asking questions in Klingon.",
  "I went on a date with someone who declared they were a wizard and tried to perform magic tricks throughout the night.",
  "I went on a date with someone who claimed to have been abducted by aliens and insisted on bringing me to their spaceship to see the evidence.",
  "I went on a date with someone who had a live streaming camera attached to their head to document all our interactions.",
  "I went on a date with someone who brought their collection of mystery meat sandwiches and insisted on sharing them.",
  "I went on a date with someone who insisted on speaking solely in Shakespearean language.",
  "I went on a date with someone who wore a Bluetooth earpiece the entire time, pretending they were on an important call.",
  "I went on a date with someone who brought a camera crew and treated our date like a reality TV show.",
  "I went on a date with someone who constantly quoted lines from horror movies as a form of foreplay.",
  "I went on a date with someone who showed up wearing a wedding dress, just for fun.",
  "I went on a date with someone who believed they could communicate with extraterrestrial beings through telepathy.",
  "I went on a date with someone who had an unusual hobby of collecting and analyzing different types of dirt.",
  "I went on a date with someone who was adamant about discussing the intricacies of their dream journal.",
  "I went on a date with someone who believed they were a modern day Sherlock Holmes and spent the evening solving imaginary mysteries around us.",
  "I went on a date with someone who revealed that they believed in lizard people ruling the world and tried to convince me to join their conspiracy theories.",
  "I went on a date with someone who carried a jar of live fireflies and released them sporadically during dinner.",
  "I went on a date with someone who claimed to have invented a time machine but had forgotten to bring it.",
  "I went on a date with someone who refused to speak unless we were discussing conspiracy theories.",
  "I went on a date with someone who brought a metal detector to the beach and spent the entire time searching for buried treasure.",
  "I went on a date with someone who had a pocket full of plastic bugs and would periodically release them on the table.",
  "I went on a date with someone who insisted on doing a live animal dissection as a bonding experience.",
  "I went on a date with someone who pretended to be possessed by a demon for the entire evening.",
  "I went on a date with someone who kept referring to themselves in the third person as a superhero.",
  "I went on a date with someone who brought a PowerPoint presentation about their future plans together.",
  "I went on a date with someone who insisted on playing hopscotch wherever we walked, disrupting passerby and confusing everyone around us.",
  "I went on a date with someone who believed they were a reincarnated Egyptian pharaoh and expected to be treated as such.",
  "I went on a date with someone who had a pet parrot that continuously added inappropriate commentary to our conversation.",
  "I went on a date with someone who insisted on eating their entire meal while blindfolded to enhance their sensory experience.",
  "I went on a date with someone who insisted on wearing a horse head mask and going by the name \"Mr. Ed\" throughout the night.",
  "I went on a date with someone who had a serious aversion to the color blue and refused to sit next to anything blue in the restaurant.",
  "I went on a date with someone who brought their ventriloquist dummy along and spoke through it the whole time.",
  "I went on a date with someone who insisted on reading aloud an entire chapter of a romance novel they wrote about us during dinner.",
  "I went on a date with someone whose idea of a fun time was dressing up as historical figures and reenacting famous battles in public parks.",
  "I went on a date with someone who brought along their ventriloquist dummy and pretended it was their actual romantic partner.",
  "I went on a date with someone who carried around a stack of self help books and quoted them constantly.",
  "I went on a date with someone who showed up with a metal detector and insisted on searching the entire restaurant for buried treasures.",
  "I went on a date with someone who continuously quoted lines from romantic movies, thinking it would woo me.",
  "I went on a date with someone who believed they were the world's greatest yo yo champion.",
  "I went on a date with someone who showed up with a backpack full of different flavors of toothpaste, insisting we try them all.",
  "I went on a date with someone who wore a full suit of armor because they wanted to impress me with their chivalry.",
  "I went on a date with someone who had an extensive collection of vintage toaster ovens and insisted on discussing each model in detail.",
  "I went on a date with someone who brought a portable karaoke machine and turned the entire evening into an impromptu singing competition.",
  "I went on a date with someone who brought their custom made voodoo doll to make sure we stayed connected.",
  "I went on a date with someone who had an infatuation with all things paranormal and insisted on conducting a seance in the middle of a coffee shop.",
  "I went on a date with someone who insisted on speaking in Shakespearean language, even ordering their food in iambic pentameter.",
  "I went on a date with someone who kept asking if I had any spare bottle caps because they were on a quest to collect 1000 of them.",
  "I went on a date with someone who couldn't stop talking about their taxidermy hobby.",
  "I went on a date with someone who insisted on playing blindfolded chess as a way to test our compatibility.",
  "I went on a date with someone who insisted on playing an intense game of chess in complete silence.",
  "I went on a date with someone who couldn't stop talking about their extensive collection of belly button lint.",
  "I went on a date with someone who brought their own projector and showed a PowerPoint presentation on why we should be together.",
  "I went on a date with someone who insisted on speaking only in rhyming couplets.",
  "I went on a date with someone who believed in the power of crystals",
  "I went on a date with someone who whispered everything they said, even when we were alone, because they thought it made them sound mysterious.",
  "I went on a date with someone who insisted on wearing a full clown costume.",
  "I went on a date with someone who exclusively spoke in rhymes, making it feel like a bizarre poetry recital.",
  "I went on a date with someone who brought their custom made voodoo doll collection as a conversation starter.",
  "I went on a date with someone who believed they were a time traveler from the year 3021.",
  "I went on a date with someone who insisted on ordering food for me without asking for my preferences.",
  "I went on a date with someone who frequently interrupted me to take selfies and post them to their social media accounts.",
  "I went on a date with someone who only ate foods in alphabetical order.",
  "I went on a date with someone who insisted on wearing a full superhero costume to the restaurant.",
  "I went on a date with someone who wore sunglasses indoors at night because they believed they were a spy incognito.",
  "I went on a date with someone who had a guidebook outlining every move they should make to win my heart.",
  "I went on a date with someone who brought a cheese grater and grated Parmesan cheese onto everything they ordered.",
  "I went on a date with someone who asked me to join their pyramid scheme.",
  "I went on a date with someone who brought a series of finger puppets and performed an elaborate puppet show at the table.",
  "I went on a date with someone who insisted on playing air guitar during all conversations.",
  "I went on a date with someone who believed they were a time traveler and wanted to discuss their adventures",
  "I went on a date with someone who carried different flavors of hot sauce in their bag.",
  "I went on a date with someone who brought a camera and asked if they could film our entire evening for their vlog.",
  "I went on a date with someone who insisted on having a staring contest throughout the entire evening.",
  "I went on a date with someone who had an elaborate conspiracy theory involving time travel and tried to convince me that they were a visitor from the future.",
  "I went on a date with someone who brought their ex partner as a surprise third wheel.",
  "I went on a date with someone who spent the entire time talking about their exes.",
  "I went on a date with someone who had a portable LED display strapped to their chest that continuously displayed their mood in emoticons.",
  "I went on a date with someone who kept interrupting me to check their aura levels using a crystal pendulum.",
  "I went on a date with someone who spent the entire time discussing their elaborate conspiracy theories.",
  "I went on a date with someone who couldn't stop talking about their impressive collection of novelty socks.",
  "I went on a date with someone who had their wedding planner on speed dial and constantly discussed their dream wedding with me.",
  "I went on a date with someone who showed up with a handheld metal detector, claiming it was a useful way to detect \"red flags\" in potential partners.",
  "I went on a date with someone who insisted on wearing a full hazmat suit because they were convinced everyone else had cooties.",
  "I went on a date with someone who brought along their life size cardboard cutout of a celebrity as their date.",
  "I went on a date with someone who showed up with their own custom made action figures of themselves.",
  "I went on a date with someone who would only eat food that had been blessed by a shaman.",
  "I went on a date with someone who showed up wearing a wedding dress, claiming they just \"wanted to be prepared.\"",
  "I went on a date with someone who had a collection of taxidermied animals on display in their living room and insisted that we spend the entire evening discussing them.",
  "I went on a date with someone who constantly interrupted the conversation to challenge me to arm wrestling competitions.",
  "I went on a date with someone who carried around a giant inflatable globe and would randomly point to countries and share facts about their traditions.",
  "I went on a date with someone who claimed to be an alien sent to study human romance.",
  "I went on a date with someone who had a strange fascination with collecting belly button lint and proudly showed me their extensive collection.",
  "I went on a date with someone who claimed to be a time traveler from the year 3012.",
  "I went on a date with someone who wouldn't eat anything unless it had been blessed by a shaman beforehand.",
  "I went on a date with someone who insisted on communicating only through Morse code using a flashlight.",
  "I went on a date with someone who couldn't stop talking about their extensive collection of celebrity belly button lint.",
  "I went on a date with someone who had a collection of taxidermied animals as home decor.",
  "I went on a date with someone who proudly displayed their collection of belly button lint sculptures.",
  "I went on a date with someone who believed they could communicate with aliens through their dream journal.",
  "I went on a date with someone who constantly quoted lines from B list movies and expected me to recognize every single one.",
  "I went on a date with someone who brought their collection of exotic snakes to the restaurant.",
  "I went on a date with someone who introduced me to their pet chicken, whom they considered their soulmate.",
  "I went on a date with someone who insisted we communicate via carrier pigeons instead of texting or calling.",
  "I went on a date with someone who brought their guitar and serenaded me with love songs they had written about our future together.",
  "I went on a date with someone who carried around a small pouch of their own blended herbs in case they needed to sprinkle them on their food.",
  "I went on a date with someone who wore a tinfoil hat and claimed it protected them from mind controlling aliens.",
  "I went on a date with someone who only communicated using interpretive dance and exaggerated hand gestures.",
  "I went on a date with someone who insisted on wearing a cape and referring to themselves as a \"mystical being of love.\"",
  "I went on a date with someone who showed up wearing a full suit of armor and insisted on jousting for my affection.",
  "I went on a date with someone whose hobby was collecting toenail clippings from celebrities.",
  "I went on a date with someone who believed they were highly skilled at telekinesis and attempted to move objects with their mind.",
  "I went on a date with someone who claimed to be a reincarnated historical figure and talked about their past lives all night.",
  "I went on a date with someone who spoke entirely in rhymes like a Dr. Seuss character.",
  "I went on a date with someone who had a collection of toenail clippings from different celebrities and asked me to guess whose were whose.",
  "I went on a date with someone who couldn't stop talking about their elaborate conspiracy theories.",
  "I went on a date with someone who had a collection of taxidermied bugs, which they claimed brought them luck in love.",
  "I went on a date with someone who brought their ventriloquist dummy and conducted the entire conversation through it.",
  "I went on a date with someone who kept bragging about their third place finish in a hot dog eating contest.",
  "I went on a date with someone who wore a full body penguin suit and insisted on waddling everywhere.",
  "I went on a date with someone who claimed to be a vampire and incessantly asked if they could \"take a nibble\" on my neck.",
  "I went on a date with someone who brought a portable karaoke machine and serenaded me with obscure 80s power ballads.",
  "I went on a date with someone who brought their own cardboard cutout of themselves to make it look like they were on a double date.",
  "I went on a date with someone who could only communicate by speaking in Shakespearean language.",
  "I went on a date with someone who had a collection of taxidermied animals and insisted on introducing me to each one.",
  "I went on a date with someone who insisted on roleplaying as different characters from a fantasy novel during the entire date.",
  "I went on a date with someone who had a deep affection for garden gnomes and insisted that we spend the evening moving them around to create different scenes.",
  "I went on a date with someone who showed up in a full on beekeeper suit and brought a hive along for \"ambiance\".",
  "I went on a date with someone who had an intense fear of ketchup and would",
  "I went on a date with someone who believed they were a vampire and tried to convince me to join their coven.",
  "I went on a date with someone who thought they were a secret agent and pretended to be on a covert mission throughout the evening.",
  "I went on a date with someone who serenaded me with death metal songs throughout the entire evening.",
  "I went on a date with someone who greeted me by reciting their homemade haiku about love.",
  "I went on a date with someone who brought a life sized cardboard cutout of themselves as a conversation starter.",
  "I went on a date with someone who brought a deck of Tarot cards and proceeded to predict our entire future together.",
  "I went on a date with someone who insisted on doing karaoke renditions of heavy metal songs during dinner.",
  "I went on a date with someone who dressed up as their favorite anime character and insisted I refer to them by that name.",
  "I went on a date with someone who continuously spoke in rhymes, turning even the most mundane conversations into poetry.",
  "I went on a date with someone who had an obsession with collecting bellybutton lint.",
  "I went on a date with someone who worked as a professional mime and insisted on having silent conversations throughout the date.",
  "I went on a date with someone who had a habit of spontaneously bursting into tears for no apparent reason.",
  "I went on a date with someone who brought a deck of tarot cards to determine if we were a good match.",
  "I went on a date with someone who challenged me to a game of table tennis in the middle of a fancy restaurant, using the dinner table as a makeshift playing field.",
  "I went on a date with someone who insisted on wearing a gas mask throughout the entire date due to contamination fears.",
  "I went on a date with someone who wore a full suit of armor, claiming it was for protection against potential heartbreak.",
  "I went on a date with someone who insisted on bringing their pet snake to curl up around their shoulders.",
  "I went on a date with someone who had an obsession with collecting and cataloging different types of leaves.",
  "I went on a date with someone who insisted on reciting cheesy pick up lines the entire night.",
  "I went on a date with someone who dressed up as a mime and communicated solely through exaggerated gestures and facial expressions.",
  "I went on a date with someone who claimed to be a vampire and asked if they could take a small sip of my blood as a gesture of trust.",
  "I went on a date with someone who took out a tape measure to measure the length of my arms and legs while we were dining.",
  "I went on a date with someone who had an uncanny ability to quote Shakespeare in every conversation, regardless of the topic.",
  "I went on a date with someone who insisted on wearing a full clown costume the entire evening.",
  "I went on a date with someone who believed they were a direct descendant of royalty and insisted on being treated like a king/queen.",
  "I went on a date with someone who insisted on using a crystal ball to make all decisions throughout the evening.",
  "I went on a date with someone who was convinced they were a talking cat and meowed throughout the entire evening.",
  "I went on a date with someone who had an extreme fascination with conspiracy theories about lizard people secretly ruling the world.",
  "I went on a date with someone who dressed up as a scarecrow and insisted on sitting in a field for the entirety of our date.",
  "I went on a date with someone who brought their therapist along to analyze our compatibility during the entire evening.",
  "I went on a date with someone who had an extreme fear of the color yellow and would freak out if they saw even a hint of it.",
  "I went on a date with someone who showed up with a binder filled with PowerPoint slides about themselves.",
  "I went on a date with someone who believed they were a Jedi and tried to show off their lightsaber skills in public.",
  "I went on a date with someone who insisted on holding my hand and reading my palm throughout the night.",
  "I went on a date with someone who sang the entire conversation like they were performing in a musical.",
  "I went on a date with someone who brought their collection of taxidermied rodents to show off their artistic talents.",
  "I went on a date with someone who believed they were a vampire and insisted on only eating rare steaks with extra blood.",
  "I went on a date with someone who insisted on wearing a different wig every time we met up.",
  "I went on a date with someone who insisted we participate in a spontaneous flash mob in the middle of the street.",
  "I went on a date with someone who had an obsession with collecting celebrity hair and showed me their prized collection.",
  "I went on a date with someone who brought a collection of glass eyeballs and had an unsettling obsession with displaying them on the restaurant table.",
  "I went on a date with someone who claimed to be a professional ghost hunter and invited me to join their next ghost investigation.",
  "I went on a date with someone who preferred to communicate solely through emojis, leaving me deciphering a complex hieroglyphic code.",
  "I went on a date with someone who had a passion for knitting hats for garden gnomes.",
  "I went on a date with someone who demanded that we communicate solely through Morse code.",
  "I went on a date with someone who had a collection of celebrity hair. Yes, real hair.",
  "I went on a date with someone who brought a fake lie detector machine and kept interrogating me with ridiculous questions.",
  "I went on a date with someone who insisted on serenading me with poorly written love songs they composed themselves.",
  "I went on a date with someone who believed they were the secret love child of a famous celebrity.",
  "I went on a date with someone who brought their own custom made voodoo doll to dinner.",
  "I went on a date with someone who treated the outing like an audition for a reality TV show.",
  "I went on a date with someone who brought their ventriloquist dummy and made it order for them throughout the meal.",
  "I went on a date with someone who brought their life size cardboard cutout of a famous celebrity as their plus one.",
  "I went on a date with someone who whispered everything they wanted me to hear and made me talk through a megaphone.",
  "I went on a date with someone who arrived with an oversized list of potential baby names for our future children.",
  "I went on a date with someone who carried around a collection of ceramic figurines and introduced them to me like they were their family members.",
  "I went on a date with someone who insisted on wearing a full Renaissance fair costume, complete with corset and jester hat.",
  "I went on a date with someone who had written an entire musical about their love life and insisted on performing a song from it.",
  "I went on a date with someone who brought their therapist along for couples counseling.",
  "I went on a date with someone who had a fascination with extreme body modification and showed me pictures of their most drastic transformations.",
  "I went on a date with someone who brought their mother along to evaluate if I was a suitable partner.",
  "I went on a date with someone who brought their own custom made board game for us to play, complete with complicated rules.",
  "I went on a date with someone who believed they were a government agent with a mission to protect the world from rogue sock puppets.",
  "I went on a date with someone who wore a full clown costume, complete with red nose and oversized shoes.",
  "I went on a date with someone who dressed up as a medieval knight and insisted on jousting in the park.",
  "I went on a date with someone who insisted on wearing a full scuba diving suit to dinner because \"love is a deep sea adventure.\"",
  "I went on a date with someone who carried around a jar of fireflies and released them during dinner.",
  "I went on a date with someone who ended every sentence with an inappropriate and out of place pirate accent.",
  "I went on a date with someone who only communicated in pig Latin.",
  "I went on a date with someone who had an obsession with collecting belly button lint and showed off their vast collection in a jar.",
  "I went on a date with someone who had a personal vendetta against wearing matching socks.",
  "I went on a date with someone who brought a crystal ball and claimed to be a psychic.",
  "I went on a date with someone who brought a whiteboard to sketch out potential future baby names.",
  "I went on a date with someone who carried around a briefcase filled with different samples of dirt to showcase their love for soil.",
  "I went on a date with someone who insisted on speaking only in pig Latin, even when the waiter took our order.",
  "I went on a date with someone who brought a live beekeeping hive to the restaurant, claiming it was necessary for ambiance.",
  "I went on a date with someone who only ate food in alphabetical order, from A to Z.",
  "I went on a date with someone who carried a pocket full of marbles and jingled them throughout the date.",
  "I went on a date with someone who spoke solely in rhymes the entire time.",
  "I went on a date with someone who insisted on speaking only in rhymes for the entire evening.",
  "I went on a date with someone who brought their therapist along to analyze our compatibility.",
  "I went on a date with someone who wore a tinfoil hat throughout the entire evening.",
  "I went on a date with someone who asked me to sign a waiver before the date began.",
  "I went on a date with someone who constantly quoted Shakespeare during the entire evening.",
  "I went on a date with someone who spent the whole evening talking about their extensive collection of toenail clippings.",
  "I went on a date with someone who constantly spoke in rhyme, like a Shakespearean rapper.",
  "I went on a date with someone who ordered an entire cake for dessert and ate it with their bare hands.",
  "I went on a date with someone who brought their pet snake with them to the restaurant.",
  "I went on a date with someone who insisted on wearing noise canceling headphones so they could have their own personal soundtrack.",
  "I went on a date with someone who insisted on watching and critiquing every couple at the restaurant, as if it were a reality TV show.",
  "I went on a date with someone who had an intense fear of cutlery and insisted on eating everything with their hands.",
  "I went on a date with someone who believed they were the reincarnation of an ancient Egyptian pharaoh and insisted on being referred to as such.",
  "I went on a date with someone who claimed to have psychic abilities and kept predicting our future together.",
  "I went on a date with someone who brought their pet tarantula along in their purse.",
  "I went on a date with someone who insisted we play a game of hide and seek in a crowded restaurant.",
  "I went on a date with someone who brought their own custom made board game based on their life story, complete with dice and game pieces.",
  "I went on a date with someone who brought a bag of fortune cookies and insisted on opening",
  "I went on a date with someone who claimed to have invented a time machine and tried convincing me to go on a journey to the 18th century.",
  "I went on a date with someone who treated their cat as their therapist and constantly asked for its input on our conversation.",
  "I went on a date with someone who kept a pet snail in their pocket and showed it to me as a conversation starter.",
  "I went on a date with someone who took me to their favorite cemetery and wanted to discuss the different gravestone designs they found fascinating.",
  "I went on a date with someone who made me sign a waiver before we could start conversing.",
  "I went on a date with someone who insisted on bringing their own set of cutlery to the restaurant, claiming it was more hygienic.",
  "I went on a date with someone who broke into spontaneous interpretive dance routines whenever they heard their favorite song playing.",
  "I went on a date with someone who brought their mother along and asked for her opinion on everything we talked about.",
  "I went on a date with someone who couldn't stop talking about their collection of toenail clippings.",
  "I went on a date with someone who brought a mini zen garden and started raking it in the middle of the restaurant.",
  "I went on a date with someone who wouldn't stop talking about their extensive stamp collection and how meaningful it was to them.",
  "I went on a date with someone who brought a ukulele and serenaded me with original love songs.",
  "I went on a date with someone who had a fascination with bending spoons with their mind and attempted to teach me their \"psychic\" powers.",
  "I went on a date with someone who ordered a plate of raw onions and ate them like apples.",
  "I went on a date with someone who collected vintage taxidermy animal tails.",
  "I went on a date with someone who showed up dressed as a clown and refused to take off the costume.",
  "I went on a date with someone who insisted on wearing a full body leotard with cat ears and a tail.",
  "I went on a date with someone who constantly compared our relationship to the movie \"Twilight,\" insisting that we were destined to be vampires.",
  "I went on a date with someone who had an intense obsession with knitting sweaters for cacti.",
  "I went on a date with someone who was convinced they were a time traveler and tried to show me pictures from various eras on their phone.",
  "I went on a date with someone who insisted on doing a background check on me before dessert.",
  "I went on a date with someone who brought their mother along as a chaperone.",
  "I went on a date with someone who wore a beekeeper suit and talked exclusively about bees and their beekeeping adventures.",
  "I went on a date with someone who insisted on doing yoga poses in the middle of the restaurant.",
  "I went on a date with someone who believed they could read minds using their pet goldfish.",
  "I went on a date with someone who insisted on role playing as a medieval knight the entire night.",
  "I went on a date with someone who insisted on discussing their extensive collection of toenail clippings and showed me pictures as proof.",
  "I went on a date with someone who insisted on wearing a different disguise every hour just to keep things \"mysterious.\"",
  "I went on a date with someone who was convinced they could communicate with plants and spent the evening sharing gardening tips with nearby flora.",
  "I went on a date with someone who had a fascination with aliens and believed they were being abducted regularly.",
  "I went on a date with someone who had an obsession with collecting rubber ducks and had a floating display in their bathtub.",
  "I went on a date with someone who declared their undying love for me within five minutes of meeting.",
  "I went on a date with someone who brought a PowerPoint presentation about their dating history.",
  "I went on a date with someone who brought their extensive collection of inappropriate adult toys as a conversation starter.",
  "I went on a date with someone who conducted a full on science experiment in the middle of the restaurant, complete with beakers and test tubes.",
  "I went on a date with someone who insisted on wearing a clown nose for the entire evening \"to keep things light.\"",
  "I went on a date with someone who believed they were an extraterrestrial being and spent the entire evening trying to convince me to join their intergalactic mission.",
  "I went on a date with someone who brought a \"relationship agreement\" with a list of rules and regulations.",
  "I went on a date with someone who brought a recorder and insisted on playing it during each lull in the conversation.",
  "I went on a date with someone who had an intense fear of buttons and had a full on panic attack whenever they saw one.",
  "I went on a date with someone who spent the entire evening talking about their obsession with collecting belly button lint.",
  "I went on a date with someone who brought their life size cardboard cutout of Justin Bieber as their plus one.",
  "I went on a date with someone who brought their homemade voodoo dolls to show me how they could control people's lives.",
  "I went on a date with someone who believed they were a cyborg and kept saying they needed an \"oil change\" every few hours.",
  "I went on a date with someone who asked me to call them \"Captain Thunderpants\" for the entire evening.",
  "I went on a date with someone who wore a professional wrestling costume and insisted on performing wrestling moves in public.",
  "I went on a date with someone who insisted on wearing a full medieval suit of armor and addressed me as \"milady\" all night.",
  "I went on a date with someone who started every sentence with \"In my parallel universe...\"",
  "I went on a date with someone who brought a collection of their baby teeth and wanted to discuss their sentimental value.",
  "I went on a date with someone who had a collection of taxidermied rodents and wanted to show them off at dinner.",
  "I went on a date with someone who insisted on wearing a tinfoil hat because they believed it protected them from mind control.",
  "I went on a date with someone who carried a pet ferret in their pocket.",
  "I went on a date with someone who believed they were a psychic and tried to predict our compatibility based on the shape of my toenails.",
  "I went on a date with someone who claimed to be a vampire and insisted on drinking their wine from a wine glass shaped like a chalice.",
  "I went on a date with someone who only communicated by whispering in my ear, even when we were in public places.",
  "I went on a date with someone who had a phobia of the color green and insisted that I avoid wearing anything green.",
  "I went on a date with someone who believed they were a reincarnated cat and would randomly meow during conversations.",
  "I went on a date with someone who believed they were being pursued by the government and insisted on speaking in code all night.",
  "I went on a date with someone who kept asking me random trivia questions and calculated our compatibility based on the results.",
  "I went on a date with someone who brought along a professional referee to settle any disagreements we might have.",
  "I went on a date with someone who had a collection of taxidermied insects and tried to convince me it was a form of art therapy.",
  "I went on a date with someone who refused to sit at a table and wanted to eat everything on the floor.",
  "I went on a date with someone who had an uncanny ability to predict the expiration dates of grocery store products.",
  "I went on a date with someone who insisted on speaking only in Shakespearean language.",
  "I went on a date with someone who insisted on doing their laundry at the laundromat during our date, showing off their extensive underwear collection.",
  "I went on a date with someone who brought a jar of pickles and insisted on conducting a taste test during dinner.",
  "I went on a date with someone who brought a collection of handmade puppets and performed a puppet show at the table.",
  "I went on a date with someone who insisted on addressing me as \"Captain\" throughout the night.",
  "I went on a date with someone who insisted on speaking only in rhymed couplets, regardless of the topic of conversation.",
  "I went on a date with someone who insisted on reciting Shakespearean sonnets throughout the entire evening.",
  "I went on a date with someone who serenaded me with a heavy metal version of \"Happy Birthday.\"",
  "I went on a date with someone who brought their pet snake and wanted me to help feed it live mice throughout the night.",
  "I went on a date with someone who carried a pocket sized ukulele and serenaded me with original songs about our potential future together.",
  "I went on a date with someone who believed they were a superhero and asked if I wanted to be their sidekick.",
  "I went on a date with someone who brought a toolbox with them and started fixing things at the table.",
  "I went on a date with someone who insisted on building a pillow fort at the restaurant and refused to eat unless we were inside it.",
  "I went on a date with someone who wore a shirt that was completely covered in photos of their exes.",
  "I went on a date with someone who had a highly developed fear of the number seven, causing them to avoid anything related to it at all costs.",
  "I went on a date with someone who insisted on wearing a tinfoil hat for protection against government mind control.",
  "I went on a date with someone who passionately argued that Nicolas Cage is a misunderstood genius.",
  "I went on a date with someone who couldn't stop talking about their dream of becoming a professional nose hair model.",
  "I went on a date with someone who brought their own portable disco ball and danced wherever we went.",
  "I went on a date with someone who brought their collection of celebrity hair clippings and bragged about their extensive collection.",
  "I went on a date with someone who insisted on showing me their extensive Beanie Baby collection at their place.",
  "I went on a date with someone who was convinced they were a time traveler from the 1800s and spoke in Old English.",
  "I went on a date with someone who declared themselves a vampire hunter and asked me to join their crusade.",
  "I went on a date with someone who had a collection of personalized bobbleheads of their exes.",
  "I went on a date with someone who asked me to sign a prenuptial agreement on the first date.",
  "I went on a date with someone who had a peculiar obsession with taxidermy and had a stuffed pet raccoon named Fred.",
  "I went on a date with someone who was convinced they could levitate objects with the power of their mind.",
  "I went on a date with someone who showed up dressed as a medieval knight, ready to joust for my affections.",
  "I went on a date with someone who brought a set of mood rings to determine our emotional compatibility.",
  "I went on a date with someone who had a fascination with circus freak shows and insisted on performing various bizarre tricks throughout the evening.",
  "I went on a date with someone who insisted on wearing a full body Chewbacca costume.",
  "I went on a date with someone who dressed as a mime and refused to speak throughout the entire evening.",
  "I went on a date with someone who brought their ventriloquist dummy as their plus one.",
  "I went on a date with someone who claimed to have a sixth sense for finding lost socks and tried to convince me to go on a sock hunting",
  "I went on a date with someone who brought a selfie stick and insisted on capturing every moment together, even at the most inappropriate times.",
  "I went on a date with someone who insisted on reenacting scenes from \"The Shining\" throughout the evening.",
  "I went on a date with someone who claimed to be a professional cow whisperer and insisted on practicing their skills at the restaurant.",
  "I went on a date with someone who insisted on feeding each other like birds at a birdfeeder.",
  "I went on a date with someone who only spoke in rhymes and refused to break character.",
  "I went on a date with someone who believed they could communicate with plants and insisted on conversing with every potted plant we passed.",
  "I went on a date with someone who had a shrine dedicated to their favorite fast food chain in their living room.",
  "I went on a date with someone who only ate food that was shaped like animals.",
  "I went on a date with someone who brought their life size cardboard cutout of a celebrity.",
  "I went on a date with someone who brought their life size ventriloquist dummy and introduced it as their best friend.",
  "I went on a date with someone who insisted on playing \"two truths and a lie\" but only used incredibly bizarre facts.",
  "I went on a date with someone who insisted",
  "I went on a date with someone who had a bizarre obsession with collecting and cataloging their belly button lint.",
  "I went on a date with someone who spent the entire time talking about their eternal love for llamas.",
  "I went on a date with someone who insisted on wearing noise canceling headphones for the entire evening.",
  "I went on a date with someone who believed they were the reincarnation of a famous historical figure and tried to convince me to bow down to them.",
  "I went on a date with someone who believed their spirit animal was a pink unicorn.",
  "I went on a date with someone who asked me to participate in a competitive eating contest as a bonding activity.",
  "I went on a date with someone who brought their collection of bellybutton lint and wanted to compare it with mine.",
  "I went on a date with someone who insisted on having a staring contest instead of engaging in small talk.",
  "I went on a date with someone who brought their own portable karaoke machine and serenaded me in the park.",
  "I went on a date with someone who wanted to reenact famous historical battles as a bonding activity.",
  "I went on a date with someone who insisted on conducting a lie detector test to ensure trustworthiness from the very beginning.",
  "I went on a date with someone who believed they were a vampire and wanted to share their immortality with me.",
  "I went on a date with someone who brought their talking ventriloquist dummy along.",
  "I went on a date with someone who wrote poetry about their extensive stamp collection and recited it to me.",
  "I went on a date with someone who carried a small portable fan with them at all times to simulate a gentle breeze during intimate moments.",
  "I went on a date with someone who continuously took selfies throughout the evening and then critiqued them out loud.",
  "I went on a date with someone who showed up with a full size cardboard cutout of themselves as a conversation starter.",
  "I went on a date with someone who brought their taxidermy collection to showcase over dinner.",
  "I went on a date with someone who collected toenail clippings as a hobby and proudly showed me their collection.",
  "I went on a date with someone who insisted on bringing a cheese grater to grate their own cheese for all our meals.",
  "I went on a date with someone who brought a set of hand puppets and insisted they were their alternate personalities.",
  "I went on a date with someone who had a shrine in their bedroom dedicated to Nicolas Cage.",
  "I went on a date with someone who had an irrational fear of feathers and panicked whenever we passed a pillow aisle.",
  "I went on a date with someone who treated the waiter like a personal servant and snapped their fingers for everything.",
  "I went on a date with someone who brought their therapy dog along, claiming it was necessary for their emotional well being.",
  "I went on a date with someone who brought their extensive doll collection and introduced me to each one by name.",
  "I went on a date with someone who only spoke in riddles, making every conversation feel like a cross between a date and a treasure hunt.",
  "I went on a date with someone who claimed to be a vampire and drank a glass of fake blood during dinner.",
  "I went on a date with someone who always carried a pocket sized Etch A Sketch and would draw portraits of strangers instead of engaging in conversation.",
  "I went on a date with someone who insisted on playing \"truth or dare\" throughout the entire evening.",
  "I went on a date with someone who showed up in full Renaissance fair attire and expected me to speak in Old English.",
  "I went on a date with someone who insisted on wearing a clown costume and juggling throughout the night.",
  "I went on a date with someone who brought a dowsing rod to the park to find \"energetic connections\" between us.",
  "I went on a date with someone who insisted on serenading me with death metal songs the entire night.",
  "I went on a date with someone who insisted on performing a magic show for me using only paperclips and rubber bands.",
  "I went on a date with someone who believed they were a psychic and insisted on giving me a reading before dessert.",
  "I went on a date with someone who believed they were a wizard and attempted to cast spells on unsuspecting passersby.",
  "I went on a date with someone who insisted on meditating in the middle of the restaurant for an hour.",
  "I went on a date with someone who brought a tarot card reader to our dinner and insisted on getting readings for both of us.",
  "I went on a date with someone who drew caricatures of the people around us and insisted on displaying them as proof of their artistic talent.",
  "I went on a date with someone who kept a collection of toenail clippings as a memento of each person they dated.",
  "I went on a date with someone who became convinced they were a vampire and tried to bite my neck.",
  "I went on a date with someone who was convinced they were a time traveler from the future and tried to prove it with scientific jargon.",
  "I went on a date with someone who was an avid collector of toenail clippings and proudly showed me their collection.",
  "I went on a date with someone who proposed a game of paintball as a test of our compatibility.",
  "I went on a date with someone who believed they were the reincarnation of Cleopatra and expected to be treated like royalty.",
  "I went on a date with someone who constantly referred to themselves in the third person, as if they were narrating their own life.",
  "I went on a date with someone who claimed to be an undercover spy, constantly looking over their shoulder.",
  "I went on a date with someone who believed they were an alien from another planet and insisted on probing my thoughts.",
  "I went on a date with someone who insisted on wearing a full clown costume the entire time.",
  "I went on a date with someone who brought a toolbox and attempted to fix everything in the restaurant even though nothing was broken.",
  "I went on a date with someone who brought a pillow and blanket, claiming they always take a nap in the middle of their dates.",
  "I went on a date with someone who carried a book of conspiracy theories and read passages aloud throughout the night.",
  "I went on a date with someone who believed they were a direct descendant of royalty and expected me to treat them like a queen.",
  "I went on a date with someone who believed they were a psychic and kept predicting our future together throughout the night.",
  "I went on a date with someone who brought a giant map and insisted on planning our future vacations together right then and there.",
  "I went on a date with someone who insisted on tasting everything on the menu before ordering.",
  "I went on a date with someone who constantly checked their horoscope for relationship advice.",
  "I went on a date with someone who insisted on wearing a horse mask the entire time.",
  "I went on a date with someone who insisted on wearing a full body dinosaur costume and wouldn't take it off.",
  "I went on a date with someone who professed their undying love for a fictional character and asked if I could dress up as that character.",
  "I went on a date with someone who had an obsession with collecting toenail clippings in little glass jars.",
  "I went on a date with someone who insisted we communicate only through mime.",
  "I went on a date with someone who carried a small portable fan with them everywhere to keep them cool, even on a winter night.",
  "I went on a date with someone who spent the entire time talking about their extensive Pokemon card collection.",
  "I went on a date with someone who believed they were a ghost hunter and asked if we could explore haunted places together.",
  "I went on a date with someone who wore a tinfoil hat and claimed it protected them from mind reading aliens.",
  "I went on a date with someone who insisted on ordering every item on the menu just to try it all out.",
  "I went on a date with someone who brought their own invisible friend and introduced them as their significant other.",
  "I went on a date with someone who believed they were a professional mime and communicated solely through exaggerated gestures.",
  "I went on a date with someone who showed up in a full length Victorian era gown and expected me to dress similarly.",
  "I went on a date with someone who believed they were a descendant of unicorns and demanded we search for one.",
  "I went on a date with someone who believed they had been abducted by aliens and made me sit through a PowerPoint presentation on the experience.",
  "I went on a date with someone who brought a bag of bird seeds and insisted on",
  "I went on a date with someone who claimed to be a professional spoon bender and tried to impress me with their skills.",
  "I went on a date with someone who insisted on role playing as Napoleon Bonaparte throughout the entire meal.",
  "I went on a date with someone who insisted on wearing a full body bodysuit covered in sequins, claiming it was their lucky dating outfit.",
  "I went on a date with someone who kept reciting bad jokes from a joke book they carried with them.",
  "I went on a date with someone who showed up wearing a full medieval suit of armor, making it impossible to move or sit comfortably.",
  "I went on a date with someone who had a strange fascination with pet rocks and insisted on bringing their favorite one to dinner.",
  "I went on a date with someone who insisted we only communicate using Morse code.",
  "I went on a date with someone who brought their ventriloquist dummy as a conversation partner."
]